NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* ERRORBITPOS1 @Bits 0..9 : Position of error bit 1 */
  #define CRACENCORE_PK_ECCERRORBITPOS_ERRORBITPOS1_Pos (0UL) /*!< Position of ERRORBITPOS1 field.                             */
  #define CRACENCORE_PK_ECCERRORBITPOS_ERRORBITPOS1_Msk (0x3FFUL << CRACENCORE_PK_ECCERRORBITPOS_ERRORBITPOS1_Pos) /*!< Bit mask
                                                                            of ERRORBITPOS1 field.*/

/* ERRORBITPOS2 @Bits 16..25 : Position of error bit 2 */
  #define CRACENCORE_PK_ECCERRORBITPOS_ERRORBITPOS2_Pos (16UL) /*!< Position of ERRORBITPOS2 field.                            */
  #define CRACENCORE_PK_ECCERRORBITPOS_ERRORBITPOS2_Msk (0x3FFUL << CRACENCORE_PK_ECCERRORBITPOS_ERRORBITPOS2_Pos) /*!< Bit mask
                                                                            of ERRORBITPOS2 field.*/


/* CRACENCORE_PK_ECCCONTROLSTATUSREG: ECC Control and Status register. */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_ResetValue (0x00000000UL) /*!< Reset value of ECCCONTROLSTATUSREG register.        */

/* DATAMEMCORRECTION @Bit 0 : Data Memory Correction flag, clear on write */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_DATAMEMCORRECTION_Pos (0UL) /*!< Position of DATAMEMCORRECTION field.              */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_DATAMEMCORRECTION_Msk (0x1UL << CRACENCORE_PK_ECCCONTROLSTATUSREG_DATAMEMCORRECTION_Pos)
                                                                            /*!< Bit mask of DATAMEMCORRECTION field.*/

/* DATAMEMFAILURE @Bit 1 : Data Memory Failure flag, clear on write */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_DATAMEMFAILURE_Pos (1UL) /*!< Position of DATAMEMFAILURE field.                    */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_DATAMEMFAILURE_Msk (0x1UL << CRACENCORE_PK_ECCCONTROLSTATUSREG_DATAMEMFAILURE_Pos)
                                                                            /*!< Bit mask of DATAMEMFAILURE field.*/

/* CODEMEMCORRECTION @Bit 2 : Code Memory Correction flag, clear on write */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_CODEMEMCORRECTION_Pos (2UL) /*!< Position of CODEMEMCORRECTION field.              */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_CODEMEMCORRECTION_Msk (0x1UL << CRACENCORE_PK_ECCCONTROLSTATUSREG_CODEMEMCORRECTION_Pos)
                                                                            /*!< Bit mask of CODEMEMCORRECTION field.*/

/* CODEMEMFAILURE @Bit 3 : Code Memory Failure flag, clear on write */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_CODEMEMFAILURE_Pos (3UL) /*!< Position of CODEMEMFAILURE field.                    */
  #define CRACENCORE_PK_ECCCONTROLSTATUSREG_CODEMEMFAILURE_Msk (0x1UL << CRACENCORE_PK_ECCCONTROLSTATUSREG_CODEMEMFAILURE_Pos)
                                                                            /*!< Bit mask of CODEMEMFAILURE field.*/


/* CRACENCORE_PK_MICROCODEFORMAT: Microcode Format register. */
  #define CRACENCORE_PK_MICROCODEFORMAT_ResetValue (0xD4B79DDAUL) /*!< Reset value of MICROCODEFORMAT register.                */

/* MICROCODEFORMAT @Bits 0..31 : Microcode format number. */
  #define CRACENCORE_PK_MICROCODEFORMAT_MICROCODEFORMAT_Pos (0UL) /*!< Position of MICROCODEFORMAT field.                      */
  #define CRACENCORE_PK_MICROCODEFORMAT_MICROCODEFORMAT_Msk (0xFFFFFFFFUL << CRACENCORE_PK_MICROCODEFORMAT_MICROCODEFORMAT_Pos)
                                                                            /*!< Bit mask of MICROCODEFORMAT field.*/


/* CRACENCORE_PK_HWVERSION: Hardware Version register. */
  #define CRACENCORE_PK_HWVERSION_ResetValue (0x00010001UL) /*!< Reset value of HWVERSION register.                            */

/* MINOR @Bits 0..15 : Minor version number. */
  #define CRACENCORE_PK_HWVERSION_MINOR_Pos (0UL)    /*!< Position of MINOR field.                                             */
  #define CRACENCORE_PK_HWVERSION_MINOR_Msk (0xFFFFUL << CRACENCORE_PK_HWVERSION_MINOR_Pos) /*!< Bit mask of MINOR field.      */

/* MAJOR @Bits 16..31 : Major version number. */
  #define CRACENCORE_PK_HWVERSION_MAJOR_Pos (16UL)   /*!< Position of MAJOR field.                                             */
  #define CRACENCORE_PK_HWVERSION_MAJOR_Msk (0xFFFFUL << CRACENCORE_PK_HWVERSION_MAJOR_Pos) /*!< Bit mask of MAJOR field.      */



/* ================================================== Struct CRACENCORE_IKG ================================================== */
/**
  * @brief IKG [CRACENCORE_IKG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start register.                                       */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register.                                      */
  __IOM uint32_t  INITDATA;                          /*!< (@ 0x00000008) InitData register.                                    */
  __IOM uint32_t  NONCE;                             /*!< (@ 0x0000000C) Nonce register.                                       */
  __IOM uint32_t  PERSONALISATIONSTRING;             /*!< (@ 0x00000010) Personalisation String register.                      */
  __IOM uint32_t  RESEEDINTERVALLSB;                 /*!< (@ 0x00000014) Reseed Interval LSB register.                         */
  __IOM uint32_t  RESEEDINTERVALMSB;                 /*!< (@ 0x00000018) Reseed Interval MSB register.                         */
  __IOM uint32_t  PKECONTROL;                        /*!< (@ 0x0000001C) PKE Control register.                                 */
  __IOM uint32_t  PKECOMMAND;                        /*!< (@ 0x00000020) PKE Command register.                                 */
  __IOM uint32_t  PKESTATUS;                         /*!< (@ 0x00000024) PKE Status register.                                  */
  __IOM uint32_t  SOFTRST;                           /*!< (@ 0x00000028) SoftRst register.                                     */
  __IOM uint32_t  HWCONFIG;                          /*!< (@ 0x0000002C) HwConfig register.                                    */
} NRF_CRACENCORE_IKG_Type;                           /*!< Size = 48 (0x030)                                                    */

/* CRACENCORE_IKG_START: Start register. */
  #define CRACENCORE_IKG_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                   */

/* START @Bit 0 : Start the Isolated Key Generation. */
  #define CRACENCORE_IKG_START_START_Pos (0UL)       /*!< Position of START field.                                             */
  #define CRACENCORE_IKG_START_START_Msk (0x1UL << CRACENCORE_IKG_START_START_Pos) /*!< Bit mask of START field.               */


