NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* CTRLAPPERI_INTEN: Enable or disable interrupt */
  #define CTRLAPPERI_INTEN_ResetValue (0x00000000UL) /*!< Reset value of INTEN register.                                       */

/* RXREADY @Bit 0 : Enable or disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTEN_RXREADY_Pos (0UL)         /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTEN_RXREADY_Msk (0x1UL << CTRLAPPERI_INTEN_RXREADY_Pos) /*!< Bit mask of RXREADY field.                 */
  #define CTRLAPPERI_INTEN_RXREADY_Min (0x0UL)       /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTEN_RXREADY_Max (0x1UL)       /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTEN_RXREADY_Disabled (0x0UL)  /*!< Disable                                                              */
  #define CTRLAPPERI_INTEN_RXREADY_Enabled (0x1UL)   /*!< Enable                                                               */

/* TXDONE @Bit 1 : Enable or disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTEN_TXDONE_Pos (1UL)          /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTEN_TXDONE_Msk (0x1UL << CTRLAPPERI_INTEN_TXDONE_Pos) /*!< Bit mask of TXDONE field.                    */
  #define CTRLAPPERI_INTEN_TXDONE_Min (0x0UL)        /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTEN_TXDONE_Max (0x1UL)        /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTEN_TXDONE_Disabled (0x0UL)   /*!< Disable                                                              */
  #define CTRLAPPERI_INTEN_TXDONE_Enabled (0x1UL)    /*!< Enable                                                               */


/* CTRLAPPERI_INTENSET: Enable interrupt */
  #define CTRLAPPERI_INTENSET_ResetValue (0x00000000UL) /*!< Reset value of INTENSET register.                                 */

/* RXREADY @Bit 0 : Write '1' to enable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENSET_RXREADY_Pos (0UL)      /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTENSET_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENSET_RXREADY_Pos) /*!< Bit mask of RXREADY field.           */
  #define CTRLAPPERI_INTENSET_RXREADY_Min (0x0UL)    /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENSET_RXREADY_Max (0x1UL)    /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENSET_RXREADY_Set (0x1UL)    /*!< Enable                                                               */
  #define CTRLAPPERI_INTENSET_RXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CTRLAPPERI_INTENSET_RXREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXDONE @Bit 1 : Write '1' to enable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENSET_TXDONE_Pos (1UL)       /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTENSET_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENSET_TXDONE_Pos) /*!< Bit mask of TXDONE field.              */
  #define CTRLAPPERI_INTENSET_TXDONE_Min (0x0UL)     /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENSET_TXDONE_Max (0x1UL)     /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENSET_TXDONE_Set (0x1UL)     /*!< Enable                                                               */
  #define CTRLAPPERI_INTENSET_TXDONE_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CTRLAPPERI_INTENSET_TXDONE_Enabled (0x1UL) /*!< Read: Enabled                                                        */


/* CTRLAPPERI_INTENCLR: Disable interrupt */
  #define CTRLAPPERI_INTENCLR_ResetValue (0x00000000UL) /*!< Reset value of INTENCLR register.                                 */

/* RXREADY @Bit 0 : Write '1' to disable interrupt for event RXREADY */
  #define CTRLAPPERI_INTENCLR_RXREADY_Pos (0UL)      /*!< Position of RXREADY field.                                           */
  #define CTRLAPPERI_INTENCLR_RXREADY_Msk (0x1UL << CTRLAPPERI_INTENCLR_RXREADY_Pos) /*!< Bit mask of RXREADY field.           */
  #define CTRLAPPERI_INTENCLR_RXREADY_Min (0x0UL)    /*!< Min enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENCLR_RXREADY_Max (0x1UL)    /*!< Max enumerator value of RXREADY field.                               */
  #define CTRLAPPERI_INTENCLR_RXREADY_Clear (0x1UL)  /*!< Disable                                                              */
  #define CTRLAPPERI_INTENCLR_RXREADY_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define CTRLAPPERI_INTENCLR_RXREADY_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* TXDONE @Bit 1 : Write '1' to disable interrupt for event TXDONE */
  #define CTRLAPPERI_INTENCLR_TXDONE_Pos (1UL)       /*!< Position of TXDONE field.                                            */
  #define CTRLAPPERI_INTENCLR_TXDONE_Msk (0x1UL << CTRLAPPERI_INTENCLR_TXDONE_Pos) /*!< Bit mask of TXDONE field.              */
  #define CTRLAPPERI_INTENCLR_TXDONE_Min (0x0UL)     /*!< Min enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENCLR_TXDONE_Max (0x1UL)     /*!< Max enumerator value of TXDONE field.                                */
  #define CTRLAPPERI_INTENCLR_TXDONE_Clear (0x1UL)   /*!< Disable                                                              */
  #define CTRLAPPERI_INTENCLR_TXDONE_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define CTRLAPPERI_INTENCLR_TXDONE_Enabled (0x1UL) /*!< Read: Enabled                                                        */


