NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* CH19 @Bit 19 : Enable or disable channel 19 */
  #define DPPIC_CHEN_CH19_Pos (19UL)                 /*!< Position of CH19 field.                                              */
  #define DPPIC_CHEN_CH19_Msk (0x1UL << DPPIC_CHEN_CH19_Pos) /*!< Bit mask of CH19 field.                                      */
  #define DPPIC_CHEN_CH19_Min (0x0UL)                /*!< Min enumerator value of CH19 field.                                  */
  #define DPPIC_CHEN_CH19_Max (0x1UL)                /*!< Max enumerator value of CH19 field.                                  */
  #define DPPIC_CHEN_CH19_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH19_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH20 @Bit 20 : Enable or disable channel 20 */
  #define DPPIC_CHEN_CH20_Pos (20UL)                 /*!< Position of CH20 field.                                              */
  #define DPPIC_CHEN_CH20_Msk (0x1UL << DPPIC_CHEN_CH20_Pos) /*!< Bit mask of CH20 field.                                      */
  #define DPPIC_CHEN_CH20_Min (0x0UL)                /*!< Min enumerator value of CH20 field.                                  */
  #define DPPIC_CHEN_CH20_Max (0x1UL)                /*!< Max enumerator value of CH20 field.                                  */
  #define DPPIC_CHEN_CH20_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH20_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH21 @Bit 21 : Enable or disable channel 21 */
  #define DPPIC_CHEN_CH21_Pos (21UL)                 /*!< Position of CH21 field.                                              */
  #define DPPIC_CHEN_CH21_Msk (0x1UL << DPPIC_CHEN_CH21_Pos) /*!< Bit mask of CH21 field.                                      */
  #define DPPIC_CHEN_CH21_Min (0x0UL)                /*!< Min enumerator value of CH21 field.                                  */
  #define DPPIC_CHEN_CH21_Max (0x1UL)                /*!< Max enumerator value of CH21 field.                                  */
  #define DPPIC_CHEN_CH21_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH21_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH22 @Bit 22 : Enable or disable channel 22 */
  #define DPPIC_CHEN_CH22_Pos (22UL)                 /*!< Position of CH22 field.                                              */
  #define DPPIC_CHEN_CH22_Msk (0x1UL << DPPIC_CHEN_CH22_Pos) /*!< Bit mask of CH22 field.                                      */
  #define DPPIC_CHEN_CH22_Min (0x0UL)                /*!< Min enumerator value of CH22 field.                                  */
  #define DPPIC_CHEN_CH22_Max (0x1UL)                /*!< Max enumerator value of CH22 field.                                  */
  #define DPPIC_CHEN_CH22_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH22_Enabled (0x1UL)            /*!< Enable channel                                                       */

/* CH23 @Bit 23 : Enable or disable channel 23 */
  #define DPPIC_CHEN_CH23_Pos (23UL)                 /*!< Position of CH23 field.                                              */
  #define DPPIC_CHEN_CH23_Msk (0x1UL << DPPIC_CHEN_CH23_Pos) /*!< Bit mask of CH23 field.                                      */
  #define DPPIC_CHEN_CH23_Min (0x0UL)                /*!< Min enumerator value of CH23 field.                                  */
  #define DPPIC_CHEN_CH23_Max (0x1UL)                /*!< Max enumerator value of CH23 field.                                  */
  #define DPPIC_CHEN_CH23_Disabled (0x0UL)           /*!< Disable channel                                                      */
  #define DPPIC_CHEN_CH23_Enabled (0x1UL)            /*!< Enable channel                                                       */


/* DPPIC_CHENSET: Channel enable set register */
  #define DPPIC_CHENSET_ResetValue (0x00000000UL)    /*!< Reset value of CHENSET register.                                     */

/* CH0 @Bit 0 : Channel 0 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH0_Pos (0UL)                /*!< Position of CH0 field.                                               */
  #define DPPIC_CHENSET_CH0_Msk (0x1UL << DPPIC_CHENSET_CH0_Pos) /*!< Bit mask of CH0 field.                                   */
  #define DPPIC_CHENSET_CH0_Min (0x0UL)              /*!< Min enumerator value of CH0 field.                                   */
  #define DPPIC_CHENSET_CH0_Max (0x1UL)              /*!< Max enumerator value of CH0 field.                                   */
  #define DPPIC_CHENSET_CH0_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH0_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH0_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH1 @Bit 1 : Channel 1 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH1_Pos (1UL)                /*!< Position of CH1 field.                                               */
  #define DPPIC_CHENSET_CH1_Msk (0x1UL << DPPIC_CHENSET_CH1_Pos) /*!< Bit mask of CH1 field.                                   */
  #define DPPIC_CHENSET_CH1_Min (0x0UL)              /*!< Min enumerator value of CH1 field.                                   */
  #define DPPIC_CHENSET_CH1_Max (0x1UL)              /*!< Max enumerator value of CH1 field.                                   */
  #define DPPIC_CHENSET_CH1_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH1_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH1_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH2 @Bit 2 : Channel 2 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH2_Pos (2UL)                /*!< Position of CH2 field.                                               */
  #define DPPIC_CHENSET_CH2_Msk (0x1UL << DPPIC_CHENSET_CH2_Pos) /*!< Bit mask of CH2 field.                                   */
  #define DPPIC_CHENSET_CH2_Min (0x0UL)              /*!< Min enumerator value of CH2 field.                                   */
  #define DPPIC_CHENSET_CH2_Max (0x1UL)              /*!< Max enumerator value of CH2 field.                                   */
  #define DPPIC_CHENSET_CH2_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH2_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH2_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH3 @Bit 3 : Channel 3 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH3_Pos (3UL)                /*!< Position of CH3 field.                                               */
  #define DPPIC_CHENSET_CH3_Msk (0x1UL << DPPIC_CHENSET_CH3_Pos) /*!< Bit mask of CH3 field.                                   */
  #define DPPIC_CHENSET_CH3_Min (0x0UL)              /*!< Min enumerator value of CH3 field.                                   */
  #define DPPIC_CHENSET_CH3_Max (0x1UL)              /*!< Max enumerator value of CH3 field.                                   */
  #define DPPIC_CHENSET_CH3_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH3_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH3_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH4 @Bit 4 : Channel 4 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH4_Pos (4UL)                /*!< Position of CH4 field.                                               */
  #define DPPIC_CHENSET_CH4_Msk (0x1UL << DPPIC_CHENSET_CH4_Pos) /*!< Bit mask of CH4 field.                                   */
  #define DPPIC_CHENSET_CH4_Min (0x0UL)              /*!< Min enumerator value of CH4 field.                                   */
  #define DPPIC_CHENSET_CH4_Max (0x1UL)              /*!< Max enumerator value of CH4 field.                                   */
  #define DPPIC_CHENSET_CH4_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH4_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH4_Set (0x1UL)              /*!< Write: Enable channel                                                */

/* CH5 @Bit 5 : Channel 5 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH5_Pos (5UL)                /*!< Position of CH5 field.                                               */
  #define DPPIC_CHENSET_CH5_Msk (0x1UL << DPPIC_CHENSET_CH5_Pos) /*!< Bit mask of CH5 field.                                   */
  #define DPPIC_CHENSET_CH5_Min (0x0UL)              /*!< Min enumerator value of CH5 field.                                   */
  #define DPPIC_CHENSET_CH5_Max (0x1UL)              /*!< Max enumerator value of CH5 field.                                   */
  #define DPPIC_CHENSET_CH5_Disabled (0x0UL)         /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH5_Enabled (0x1UL)          /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH5_Set (0x1UL)              /*!< Write: Enable channel                                                */

