NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
  #define ETM_TRCVIPCSSCTLR_START6_Pos (6UL)         /*!< Position of START6 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START6_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START6_Pos) /*!< Bit mask of START6 field.                  */
  #define ETM_TRCVIPCSSCTLR_START6_Min (0x0UL)       /*!< Min enumerator value of START6 field.                                */
  #define ETM_TRCVIPCSSCTLR_START6_Max (0x1UL)       /*!< Max enumerator value of START6 field.                                */
  #define ETM_TRCVIPCSSCTLR_START6_Disabled (0x0UL)  /*!< The single PE comparator input 6, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START6_Enabled (0x1UL)   /*!< The single PE comparator input 6, is selected as a start resource.   */

/* START7 @Bit 7 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of starting
                   trace */

  #define ETM_TRCVIPCSSCTLR_START7_Pos (7UL)         /*!< Position of START7 field.                                            */
  #define ETM_TRCVIPCSSCTLR_START7_Msk (0x1UL << ETM_TRCVIPCSSCTLR_START7_Pos) /*!< Bit mask of START7 field.                  */
  #define ETM_TRCVIPCSSCTLR_START7_Min (0x0UL)       /*!< Min enumerator value of START7 field.                                */
  #define ETM_TRCVIPCSSCTLR_START7_Max (0x1UL)       /*!< Max enumerator value of START7 field.                                */
  #define ETM_TRCVIPCSSCTLR_START7_Disabled (0x0UL)  /*!< The single PE comparator input 7, is not selected as a start
                                                          resource.*/
  #define ETM_TRCVIPCSSCTLR_START7_Enabled (0x1UL)   /*!< The single PE comparator input 7, is selected as a start resource.   */

/* STOP0 @Bit 16 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP0_Pos (16UL)         /*!< Position of STOP0 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP0_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP0_Pos) /*!< Bit mask of STOP0 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP0_Min (0x0UL)        /*!< Min enumerator value of STOP0 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP0_Max (0x1UL)        /*!< Max enumerator value of STOP0 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP0_Disabled (0x0UL)   /*!< The single PE comparator input 0, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP0_Enabled (0x1UL)    /*!< The single PE comparator input 0, is selected as a stop resource.    */

/* STOP1 @Bit 17 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP1_Pos (17UL)         /*!< Position of STOP1 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP1_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP1_Pos) /*!< Bit mask of STOP1 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP1_Min (0x0UL)        /*!< Min enumerator value of STOP1 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP1_Max (0x1UL)        /*!< Max enumerator value of STOP1 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP1_Disabled (0x0UL)   /*!< The single PE comparator input 1, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP1_Enabled (0x1UL)    /*!< The single PE comparator input 1, is selected as a stop resource.    */

/* STOP2 @Bit 18 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP2_Pos (18UL)         /*!< Position of STOP2 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP2_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP2_Pos) /*!< Bit mask of STOP2 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP2_Min (0x0UL)        /*!< Min enumerator value of STOP2 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP2_Max (0x1UL)        /*!< Max enumerator value of STOP2 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP2_Disabled (0x0UL)   /*!< The single PE comparator input 2, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP2_Enabled (0x1UL)    /*!< The single PE comparator input 2, is selected as a stop resource.    */

/* STOP3 @Bit 19 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP3_Pos (19UL)         /*!< Position of STOP3 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP3_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP3_Pos) /*!< Bit mask of STOP3 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP3_Min (0x0UL)        /*!< Min enumerator value of STOP3 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP3_Max (0x1UL)        /*!< Max enumerator value of STOP3 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP3_Disabled (0x0UL)   /*!< The single PE comparator input 3, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP3_Enabled (0x1UL)    /*!< The single PE comparator input 3, is selected as a stop resource.    */

/* STOP4 @Bit 20 : Selects which PE comparator inputs are in use with ViewInst start/stop control, for the purpose of stopping
                   trace. */

  #define ETM_TRCVIPCSSCTLR_STOP4_Pos (20UL)         /*!< Position of STOP4 field.                                             */
  #define ETM_TRCVIPCSSCTLR_STOP4_Msk (0x1UL << ETM_TRCVIPCSSCTLR_STOP4_Pos) /*!< Bit mask of STOP4 field.                     */
  #define ETM_TRCVIPCSSCTLR_STOP4_Min (0x0UL)        /*!< Min enumerator value of STOP4 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP4_Max (0x1UL)        /*!< Max enumerator value of STOP4 field.                                 */
  #define ETM_TRCVIPCSSCTLR_STOP4_Disabled (0x0UL)   /*!< The single PE comparator input 4, is not selected as a stop resource.*/
  #define ETM_TRCVIPCSSCTLR_STOP4_Enabled (0x1UL)    /*!< The single PE comparator input 4, is selected as a stop resource.    */

