NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* ETM_TRCSEQSTR: Use this to set, or read, the sequencer state. Might ignore writes when the trace unit is enabled or not idle.
                   Only returns stable data when TRCSTATR.PMSTABLE == 1. When the sequencer is used, all sequencer state
                   transitions must be programmed with a valid event. */

  #define ETM_TRCSEQSTR_ResetValue (0x00000000UL)    /*!< Reset value of TRCSEQSTR register.                                   */

/* STATE @Bits 0..1 : Sets or returns the state of the sequencer. */
  #define ETM_TRCSEQSTR_STATE_Pos (0UL)              /*!< Position of STATE field.                                             */
  #define ETM_TRCSEQSTR_STATE_Msk (0x3UL << ETM_TRCSEQSTR_STATE_Pos) /*!< Bit mask of STATE field.                             */
  #define ETM_TRCSEQSTR_STATE_Min (0x0UL)            /*!< Min enumerator value of STATE field.                                 */
  #define ETM_TRCSEQSTR_STATE_Max (0x3UL)            /*!< Max enumerator value of STATE field.                                 */
  #define ETM_TRCSEQSTR_STATE_State0 (0x0UL)         /*!< The sequencer is in state 0.                                         */
  #define ETM_TRCSEQSTR_STATE_State1 (0x1UL)         /*!< The sequencer is in state 1.                                         */
  #define ETM_TRCSEQSTR_STATE_State2 (0x2UL)         /*!< The sequencer is in state 2.                                         */
  #define ETM_TRCSEQSTR_STATE_State3 (0x3UL)         /*!< The sequencer is in state 3.                                         */


/* ETM_TRCEXTINSELR: Use this to set, or read, which external inputs are resources to the trace unit. Might ignore writes when
                      the trace unit is enabled or not idle. Only returns stable data when TRCSTATR.PMSTABLE == 1. When the
                      sequencer is used, all sequencer state transitions must be programmed with a valid event. */

  #define ETM_TRCEXTINSELR_ResetValue (0x00000000UL) /*!< Reset value of TRCEXTINSELR register.                                */

/* SEL0 @Bits 0..7 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL0_Pos (0UL)            /*!< Position of SEL0 field.                                              */
  #define ETM_TRCEXTINSELR_SEL0_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL0_Pos) /*!< Bit mask of SEL0 field.                         */
  #define ETM_TRCEXTINSELR_SEL0_Min (0x00UL)         /*!< Min value of SEL0 field.                                             */
  #define ETM_TRCEXTINSELR_SEL0_Max (0xFFUL)         /*!< Max size of SEL0 field.                                              */

/* SEL1 @Bits 8..15 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL1_Pos (8UL)            /*!< Position of SEL1 field.                                              */
  #define ETM_TRCEXTINSELR_SEL1_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL1_Pos) /*!< Bit mask of SEL1 field.                         */
  #define ETM_TRCEXTINSELR_SEL1_Min (0x00UL)         /*!< Min value of SEL1 field.                                             */
  #define ETM_TRCEXTINSELR_SEL1_Max (0xFFUL)         /*!< Max size of SEL1 field.                                              */

/* SEL2 @Bits 16..23 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL2_Pos (16UL)           /*!< Position of SEL2 field.                                              */
  #define ETM_TRCEXTINSELR_SEL2_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL2_Pos) /*!< Bit mask of SEL2 field.                         */
  #define ETM_TRCEXTINSELR_SEL2_Min (0x00UL)         /*!< Min value of SEL2 field.                                             */
  #define ETM_TRCEXTINSELR_SEL2_Max (0xFFUL)         /*!< Max size of SEL2 field.                                              */

/* SEL3 @Bits 24..31 : Each field in this collection selects an external input as a resource for the trace unit. */
  #define ETM_TRCEXTINSELR_SEL3_Pos (24UL)           /*!< Position of SEL3 field.                                              */
  #define ETM_TRCEXTINSELR_SEL3_Msk (0xFFUL << ETM_TRCEXTINSELR_SEL3_Pos) /*!< Bit mask of SEL3 field.                         */
  #define ETM_TRCEXTINSELR_SEL3_Min (0x00UL)         /*!< Min value of SEL3 field.                                             */
  #define ETM_TRCEXTINSELR_SEL3_Max (0xFFUL)         /*!< Max size of SEL3 field.                                              */


/* ETM_TRCCNTRLDVR: This sets or returns the reload count value for counter n. Might ignore writes when the trace unit is
                     enabled or not idle. */

  #define ETM_TRCCNTRLDVR_MaxCount (4UL)             /*!< Max size of TRCCNTRLDVR[4] array.                                    */
  #define ETM_TRCCNTRLDVR_MaxIndex (3UL)             /*!< Max index of TRCCNTRLDVR[4] array.                                   */
  #define ETM_TRCCNTRLDVR_MinIndex (0UL)             /*!< Min index of TRCCNTRLDVR[4] array.                                   */
  #define ETM_TRCCNTRLDVR_ResetValue (0x00000000UL)  /*!< Reset value of TRCCNTRLDVR[4] register.                              */

/* VALUE @Bits 0..15 : Contains the reload value for counter n. When a reload event occurs for counter n then the trace unit
                       copies the VALUEn field into counter n. */

  #define ETM_TRCCNTRLDVR_VALUE_Pos (0UL)            /*!< Position of VALUE field.                                             */
  #define ETM_TRCCNTRLDVR_VALUE_Msk (0xFFFFUL << ETM_TRCCNTRLDVR_VALUE_Pos) /*!< Bit mask of VALUE field.                      */
  #define ETM_TRCCNTRLDVR_VALUE_Min (0x0000UL)       /*!< Min value of VALUE field.                                            */
  #define ETM_TRCCNTRLDVR_VALUE_Max (0xFFFFUL)       /*!< Max size of VALUE field.                                             */


/* ETM_TRCCNTCTLR: Controls the operation of counter n. Might ignore writes when the trace unit is enabled or not idle. */
  #define ETM_TRCCNTCTLR_MaxCount (4UL)              /*!< Max size of TRCCNTCTLR[4] array.                                     */
  #define ETM_TRCCNTCTLR_MaxIndex (3UL)              /*!< Max index of TRCCNTCTLR[4] array.                                    */
  #define ETM_TRCCNTCTLR_MinIndex (0UL)              /*!< Min index of TRCCNTCTLR[4] array.                                    */
  #define ETM_TRCCNTCTLR_ResetValue (0x00000000UL)   /*!< Reset value of TRCCNTCTLR[4] register.                               */

