NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* ID6 @Bit 6 : Drives the ATIDMI[6] output pin. */
  #define ETM_TRCITATBIDR_ID6_Pos (6UL)              /*!< Position of ID6 field.                                               */
  #define ETM_TRCITATBIDR_ID6_Msk (0x1UL << ETM_TRCITATBIDR_ID6_Pos) /*!< Bit mask of ID6 field.                               */


/* ETM_TRCITIATBINR: Reads the state of the input pins. */
  #define ETM_TRCITIATBINR_ResetValue (0x00000000UL) /*!< Reset value of TRCITIATBINR register.                                */

/* ATVALID @Bit 0 : Returns the value of the ATVALIDMI input pin. */
  #define ETM_TRCITIATBINR_ATVALID_Pos (0UL)         /*!< Position of ATVALID field.                                           */
  #define ETM_TRCITIATBINR_ATVALID_Msk (0x1UL << ETM_TRCITIATBINR_ATVALID_Pos) /*!< Bit mask of ATVALID field.                 */

/* AFREADY @Bit 1 : Returns the value of the AFREADYMI input pin. */
  #define ETM_TRCITIATBINR_AFREADY_Pos (1UL)         /*!< Position of AFREADY field.                                           */
  #define ETM_TRCITIATBINR_AFREADY_Msk (0x1UL << ETM_TRCITIATBINR_AFREADY_Pos) /*!< Bit mask of AFREADY field.                 */


/* ETM_TRCITIATBOUTR: Sets the state of the output pins. */
  #define ETM_TRCITIATBOUTR_ResetValue (0x00000000UL) /*!< Reset value of TRCITIATBOUTR register.                              */

/* ATVALID @Bit 0 : Drives the ATVALIDMI output pin. */
  #define ETM_TRCITIATBOUTR_ATVALID_Pos (0UL)        /*!< Position of ATVALID field.                                           */
  #define ETM_TRCITIATBOUTR_ATVALID_Msk (0x1UL << ETM_TRCITIATBOUTR_ATVALID_Pos) /*!< Bit mask of ATVALID field.               */

/* AFREADY @Bit 1 : Drives the AFREADYMI output pin. */
  #define ETM_TRCITIATBOUTR_AFREADY_Pos (1UL)        /*!< Position of AFREADY field.                                           */
  #define ETM_TRCITIATBOUTR_AFREADY_Msk (0x1UL << ETM_TRCITIATBOUTR_AFREADY_Pos) /*!< Bit mask of AFREADY field.               */


/* ETM_TRCITCTRL: Enables topology detection or integration testing, by putting ETM-M33 into integration mode. */
  #define ETM_TRCITCTRL_ResetValue (0x00000000UL)    /*!< Reset value of TRCITCTRL register.                                   */

/* IME @Bit 0 : Integration mode enable */
  #define ETM_TRCITCTRL_IME_Pos (0UL)                /*!< Position of IME field.                                               */
  #define ETM_TRCITCTRL_IME_Msk (0x1UL << ETM_TRCITCTRL_IME_Pos) /*!< Bit mask of IME field.                                   */
  #define ETM_TRCITCTRL_IME_Min (0x0UL)              /*!< Min enumerator value of IME field.                                   */
  #define ETM_TRCITCTRL_IME_Max (0x1UL)              /*!< Max enumerator value of IME field.                                   */
  #define ETM_TRCITCTRL_IME_Disabled (0x0UL)         /*!< ETM is not in integration mode.                                      */
  #define ETM_TRCITCTRL_IME_Enabled (0x1UL)          /*!< ETM is in integration mode.                                          */


/* ETM_TRCCLAIMSET: Sets bits in the claim tag and determines the number of claim tag bits implemented. */
  #define ETM_TRCCLAIMSET_ResetValue (0x00000000UL)  /*!< Reset value of TRCCLAIMSET register.                                 */

/* SET0 @Bit 0 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET0_Pos (0UL)             /*!< Position of SET0 field.                                              */
  #define ETM_TRCCLAIMSET_SET0_Msk (0x1UL << ETM_TRCCLAIMSET_SET0_Pos) /*!< Bit mask of SET0 field.                            */
  #define ETM_TRCCLAIMSET_SET0_Min (0x0UL)           /*!< Min enumerator value of SET0 field.                                  */
  #define ETM_TRCCLAIMSET_SET0_Max (0x1UL)           /*!< Max enumerator value of SET0 field.                                  */
  #define ETM_TRCCLAIMSET_SET0_NotSet (0x0UL)        /*!< Claim tag 0 is not set.                                              */
  #define ETM_TRCCLAIMSET_SET0_Set (0x1UL)           /*!< Claim tag 0 is set.                                                  */
  #define ETM_TRCCLAIMSET_SET0_Claim (0x1UL)         /*!< Set claim tag 0.                                                     */

/* SET1 @Bit 1 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET1_Pos (1UL)             /*!< Position of SET1 field.                                              */
  #define ETM_TRCCLAIMSET_SET1_Msk (0x1UL << ETM_TRCCLAIMSET_SET1_Pos) /*!< Bit mask of SET1 field.                            */
  #define ETM_TRCCLAIMSET_SET1_Min (0x0UL)           /*!< Min enumerator value of SET1 field.                                  */
  #define ETM_TRCCLAIMSET_SET1_Max (0x1UL)           /*!< Max enumerator value of SET1 field.                                  */
  #define ETM_TRCCLAIMSET_SET1_NotSet (0x0UL)        /*!< Claim tag 1 is not set.                                              */
  #define ETM_TRCCLAIMSET_SET1_Set (0x1UL)           /*!< Claim tag 1 is set.                                                  */
  #define ETM_TRCCLAIMSET_SET1_Claim (0x1UL)         /*!< Set claim tag 1.                                                     */

/* SET2 @Bit 2 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET2_Pos (2UL)             /*!< Position of SET2 field.                                              */
  #define ETM_TRCCLAIMSET_SET2_Msk (0x1UL << ETM_TRCCLAIMSET_SET2_Pos) /*!< Bit mask of SET2 field.                            */
  #define ETM_TRCCLAIMSET_SET2_Min (0x0UL)           /*!< Min enumerator value of SET2 field.                                  */
  #define ETM_TRCCLAIMSET_SET2_Max (0x1UL)           /*!< Max enumerator value of SET2 field.                                  */
  #define ETM_TRCCLAIMSET_SET2_NotSet (0x0UL)        /*!< Claim tag 2 is not set.                                              */
  #define ETM_TRCCLAIMSET_SET2_Set (0x1UL)           /*!< Claim tag 2 is set.                                                  */
  #define ETM_TRCCLAIMSET_SET2_Claim (0x1UL)         /*!< Set claim tag 2.                                                     */

/* SET3 @Bit 3 : Claim tag set register */
  #define ETM_TRCCLAIMSET_SET3_Pos (3UL)             /*!< Position of SET3 field.                                              */
  #define ETM_TRCCLAIMSET_SET3_Msk (0x1UL << ETM_TRCCLAIMSET_SET3_Pos) /*!< Bit mask of SET3 field.                            */
  #define ETM_TRCCLAIMSET_SET3_Min (0x0UL)           /*!< Min enumerator value of SET3 field.                                  */
  #define ETM_TRCCLAIMSET_SET3_Max (0x1UL)           /*!< Max enumerator value of SET3 field.                                  */
  #define ETM_TRCCLAIMSET_SET3_NotSet (0x0UL)        /*!< Claim tag 3 is not set.                                              */
  #define ETM_TRCCLAIMSET_SET3_Set (0x1UL)           /*!< Claim tag 3 is set.                                                  */
  #define ETM_TRCCLAIMSET_SET3_Claim (0x1UL)         /*!< Set claim tag 3.                                                     */


/* ETM_TRCCLAIMCLR: Clears bits in the claim tag and determines the current value of the claim tag. */
  #define ETM_TRCCLAIMCLR_ResetValue (0x00000000UL)  /*!< Reset value of TRCCLAIMCLR register.                                 */

/* CLR0 @Bit 0 : Claim tag clear register */
  #define ETM_TRCCLAIMCLR_CLR0_Pos (0UL)             /*!< Position of CLR0 field.                                              */
  #define ETM_TRCCLAIMCLR_CLR0_Msk (0x1UL << ETM_TRCCLAIMCLR_CLR0_Pos) /*!< Bit mask of CLR0 field.                            */
  #define ETM_TRCCLAIMCLR_CLR0_Min (0x0UL)           /*!< Min enumerator value of CLR0 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR0_Max (0x1UL)           /*!< Max enumerator value of CLR0 field.                                  */
  #define ETM_TRCCLAIMCLR_CLR0_NotSet (0x0UL)        /*!< Claim tag 0 is not set.                                              */
  #define ETM_TRCCLAIMCLR_CLR0_Set (0x1UL)           /*!< Claim tag 0 is set.                                                  */
  #define ETM_TRCCLAIMCLR_CLR0_Clear (0x1UL)         /*!< Clear claim tag 0.                                                   */

