NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* PIN26 @Bit 26 : Pin 26 */
  #define GPIO_OUT_PIN26_Pos (26UL)                  /*!< Position of PIN26 field.                                             */
  #define GPIO_OUT_PIN26_Msk (0x1UL << GPIO_OUT_PIN26_Pos) /*!< Bit mask of PIN26 field.                                       */
  #define GPIO_OUT_PIN26_Min (0x0UL)                 /*!< Min enumerator value of PIN26 field.                                 */
  #define GPIO_OUT_PIN26_Max (0x1UL)                 /*!< Max enumerator value of PIN26 field.                                 */
  #define GPIO_OUT_PIN26_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN26_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN27 @Bit 27 : Pin 27 */
  #define GPIO_OUT_PIN27_Pos (27UL)                  /*!< Position of PIN27 field.                                             */
  #define GPIO_OUT_PIN27_Msk (0x1UL << GPIO_OUT_PIN27_Pos) /*!< Bit mask of PIN27 field.                                       */
  #define GPIO_OUT_PIN27_Min (0x0UL)                 /*!< Min enumerator value of PIN27 field.                                 */
  #define GPIO_OUT_PIN27_Max (0x1UL)                 /*!< Max enumerator value of PIN27 field.                                 */
  #define GPIO_OUT_PIN27_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN27_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN28 @Bit 28 : Pin 28 */
  #define GPIO_OUT_PIN28_Pos (28UL)                  /*!< Position of PIN28 field.                                             */
  #define GPIO_OUT_PIN28_Msk (0x1UL << GPIO_OUT_PIN28_Pos) /*!< Bit mask of PIN28 field.                                       */
  #define GPIO_OUT_PIN28_Min (0x0UL)                 /*!< Min enumerator value of PIN28 field.                                 */
  #define GPIO_OUT_PIN28_Max (0x1UL)                 /*!< Max enumerator value of PIN28 field.                                 */
  #define GPIO_OUT_PIN28_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN28_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN29 @Bit 29 : Pin 29 */
  #define GPIO_OUT_PIN29_Pos (29UL)                  /*!< Position of PIN29 field.                                             */
  #define GPIO_OUT_PIN29_Msk (0x1UL << GPIO_OUT_PIN29_Pos) /*!< Bit mask of PIN29 field.                                       */
  #define GPIO_OUT_PIN29_Min (0x0UL)                 /*!< Min enumerator value of PIN29 field.                                 */
  #define GPIO_OUT_PIN29_Max (0x1UL)                 /*!< Max enumerator value of PIN29 field.                                 */
  #define GPIO_OUT_PIN29_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN29_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN30 @Bit 30 : Pin 30 */
  #define GPIO_OUT_PIN30_Pos (30UL)                  /*!< Position of PIN30 field.                                             */
  #define GPIO_OUT_PIN30_Msk (0x1UL << GPIO_OUT_PIN30_Pos) /*!< Bit mask of PIN30 field.                                       */
  #define GPIO_OUT_PIN30_Min (0x0UL)                 /*!< Min enumerator value of PIN30 field.                                 */
  #define GPIO_OUT_PIN30_Max (0x1UL)                 /*!< Max enumerator value of PIN30 field.                                 */
  #define GPIO_OUT_PIN30_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN30_High (0x1UL)                /*!< Pin driver is high                                                   */

/* PIN31 @Bit 31 : Pin 31 */
  #define GPIO_OUT_PIN31_Pos (31UL)                  /*!< Position of PIN31 field.                                             */
  #define GPIO_OUT_PIN31_Msk (0x1UL << GPIO_OUT_PIN31_Pos) /*!< Bit mask of PIN31 field.                                       */
  #define GPIO_OUT_PIN31_Min (0x0UL)                 /*!< Min enumerator value of PIN31 field.                                 */
  #define GPIO_OUT_PIN31_Max (0x1UL)                 /*!< Max enumerator value of PIN31 field.                                 */
  #define GPIO_OUT_PIN31_Low (0x0UL)                 /*!< Pin driver is low                                                    */
  #define GPIO_OUT_PIN31_High (0x1UL)                /*!< Pin driver is high                                                   */


/* GPIO_OUTSET: Set individual bits in GPIO port */
  #define GPIO_OUTSET_ResetValue (0x00000000UL)      /*!< Reset value of OUTSET register.                                      */

/* PIN0 @Bit 0 : Pin 0 */
  #define GPIO_OUTSET_PIN0_Pos (0UL)                 /*!< Position of PIN0 field.                                              */
  #define GPIO_OUTSET_PIN0_Msk (0x1UL << GPIO_OUTSET_PIN0_Pos) /*!< Bit mask of PIN0 field.                                    */
  #define GPIO_OUTSET_PIN0_Min (0x0UL)               /*!< Min enumerator value of PIN0 field.                                  */
  #define GPIO_OUTSET_PIN0_Max (0x1UL)               /*!< Max enumerator value of PIN0 field.                                  */
  #define GPIO_OUTSET_PIN0_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN0_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN0_Set (0x1UL)               /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_OUTSET_PIN1_Pos (1UL)                 /*!< Position of PIN1 field.                                              */
  #define GPIO_OUTSET_PIN1_Msk (0x1UL << GPIO_OUTSET_PIN1_Pos) /*!< Bit mask of PIN1 field.                                    */
  #define GPIO_OUTSET_PIN1_Min (0x0UL)               /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_OUTSET_PIN1_Max (0x1UL)               /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_OUTSET_PIN1_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN1_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN1_Set (0x1UL)               /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_OUTSET_PIN2_Pos (2UL)                 /*!< Position of PIN2 field.                                              */
  #define GPIO_OUTSET_PIN2_Msk (0x1UL << GPIO_OUTSET_PIN2_Pos) /*!< Bit mask of PIN2 field.                                    */
  #define GPIO_OUTSET_PIN2_Min (0x0UL)               /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_OUTSET_PIN2_Max (0x1UL)               /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_OUTSET_PIN2_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN2_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN2_Set (0x1UL)               /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_OUTSET_PIN3_Pos (3UL)                 /*!< Position of PIN3 field.                                              */
  #define GPIO_OUTSET_PIN3_Msk (0x1UL << GPIO_OUTSET_PIN3_Pos) /*!< Bit mask of PIN3 field.                                    */
  #define GPIO_OUTSET_PIN3_Min (0x0UL)               /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_OUTSET_PIN3_Max (0x1UL)               /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_OUTSET_PIN3_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTSET_PIN3_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTSET_PIN3_Set (0x1UL)               /*!< Write: writing a '1' sets the pin high; writing a '0' has no effect  */

