NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* PIN1 @Bit 1 : Pin 1 */
  #define GPIO_OUTCLR_PIN1_Pos (1UL)                 /*!< Position of PIN1 field.                                              */
  #define GPIO_OUTCLR_PIN1_Msk (0x1UL << GPIO_OUTCLR_PIN1_Pos) /*!< Bit mask of PIN1 field.                                    */
  #define GPIO_OUTCLR_PIN1_Min (0x0UL)               /*!< Min enumerator value of PIN1 field.                                  */
  #define GPIO_OUTCLR_PIN1_Max (0x1UL)               /*!< Max enumerator value of PIN1 field.                                  */
  #define GPIO_OUTCLR_PIN1_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN1_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN1_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN2 @Bit 2 : Pin 2 */
  #define GPIO_OUTCLR_PIN2_Pos (2UL)                 /*!< Position of PIN2 field.                                              */
  #define GPIO_OUTCLR_PIN2_Msk (0x1UL << GPIO_OUTCLR_PIN2_Pos) /*!< Bit mask of PIN2 field.                                    */
  #define GPIO_OUTCLR_PIN2_Min (0x0UL)               /*!< Min enumerator value of PIN2 field.                                  */
  #define GPIO_OUTCLR_PIN2_Max (0x1UL)               /*!< Max enumerator value of PIN2 field.                                  */
  #define GPIO_OUTCLR_PIN2_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN2_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN2_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN3 @Bit 3 : Pin 3 */
  #define GPIO_OUTCLR_PIN3_Pos (3UL)                 /*!< Position of PIN3 field.                                              */
  #define GPIO_OUTCLR_PIN3_Msk (0x1UL << GPIO_OUTCLR_PIN3_Pos) /*!< Bit mask of PIN3 field.                                    */
  #define GPIO_OUTCLR_PIN3_Min (0x0UL)               /*!< Min enumerator value of PIN3 field.                                  */
  #define GPIO_OUTCLR_PIN3_Max (0x1UL)               /*!< Max enumerator value of PIN3 field.                                  */
  #define GPIO_OUTCLR_PIN3_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN3_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN3_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_OUTCLR_PIN4_Pos (4UL)                 /*!< Position of PIN4 field.                                              */
  #define GPIO_OUTCLR_PIN4_Msk (0x1UL << GPIO_OUTCLR_PIN4_Pos) /*!< Bit mask of PIN4 field.                                    */
  #define GPIO_OUTCLR_PIN4_Min (0x0UL)               /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_OUTCLR_PIN4_Max (0x1UL)               /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_OUTCLR_PIN4_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN4_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN4_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_OUTCLR_PIN5_Pos (5UL)                 /*!< Position of PIN5 field.                                              */
  #define GPIO_OUTCLR_PIN5_Msk (0x1UL << GPIO_OUTCLR_PIN5_Pos) /*!< Bit mask of PIN5 field.                                    */
  #define GPIO_OUTCLR_PIN5_Min (0x0UL)               /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_OUTCLR_PIN5_Max (0x1UL)               /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_OUTCLR_PIN5_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN5_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN5_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_OUTCLR_PIN6_Pos (6UL)                 /*!< Position of PIN6 field.                                              */
  #define GPIO_OUTCLR_PIN6_Msk (0x1UL << GPIO_OUTCLR_PIN6_Pos) /*!< Bit mask of PIN6 field.                                    */
  #define GPIO_OUTCLR_PIN6_Min (0x0UL)               /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_OUTCLR_PIN6_Max (0x1UL)               /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_OUTCLR_PIN6_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN6_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN6_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_OUTCLR_PIN7_Pos (7UL)                 /*!< Position of PIN7 field.                                              */
  #define GPIO_OUTCLR_PIN7_Msk (0x1UL << GPIO_OUTCLR_PIN7_Pos) /*!< Bit mask of PIN7 field.                                    */
  #define GPIO_OUTCLR_PIN7_Min (0x0UL)               /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_OUTCLR_PIN7_Max (0x1UL)               /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_OUTCLR_PIN7_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN7_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN7_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_OUTCLR_PIN8_Pos (8UL)                 /*!< Position of PIN8 field.                                              */
  #define GPIO_OUTCLR_PIN8_Msk (0x1UL << GPIO_OUTCLR_PIN8_Pos) /*!< Bit mask of PIN8 field.                                    */
  #define GPIO_OUTCLR_PIN8_Min (0x0UL)               /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_OUTCLR_PIN8_Max (0x1UL)               /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_OUTCLR_PIN8_Low (0x0UL)               /*!< Read: pin driver is low                                              */
  #define GPIO_OUTCLR_PIN8_High (0x1UL)              /*!< Read: pin driver is high                                             */
  #define GPIO_OUTCLR_PIN8_Clear (0x1UL)             /*!< Write: writing a '1' sets the pin low; writing a '0' has no effect   */

