NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* PIN4 @Bit 4 : Pin 4 */
  #define GPIO_DIR_PIN4_Pos (4UL)                    /*!< Position of PIN4 field.                                              */
  #define GPIO_DIR_PIN4_Msk (0x1UL << GPIO_DIR_PIN4_Pos) /*!< Bit mask of PIN4 field.                                          */
  #define GPIO_DIR_PIN4_Min (0x0UL)                  /*!< Min enumerator value of PIN4 field.                                  */
  #define GPIO_DIR_PIN4_Max (0x1UL)                  /*!< Max enumerator value of PIN4 field.                                  */
  #define GPIO_DIR_PIN4_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN4_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN5 @Bit 5 : Pin 5 */
  #define GPIO_DIR_PIN5_Pos (5UL)                    /*!< Position of PIN5 field.                                              */
  #define GPIO_DIR_PIN5_Msk (0x1UL << GPIO_DIR_PIN5_Pos) /*!< Bit mask of PIN5 field.                                          */
  #define GPIO_DIR_PIN5_Min (0x0UL)                  /*!< Min enumerator value of PIN5 field.                                  */
  #define GPIO_DIR_PIN5_Max (0x1UL)                  /*!< Max enumerator value of PIN5 field.                                  */
  #define GPIO_DIR_PIN5_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN5_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN6 @Bit 6 : Pin 6 */
  #define GPIO_DIR_PIN6_Pos (6UL)                    /*!< Position of PIN6 field.                                              */
  #define GPIO_DIR_PIN6_Msk (0x1UL << GPIO_DIR_PIN6_Pos) /*!< Bit mask of PIN6 field.                                          */
  #define GPIO_DIR_PIN6_Min (0x0UL)                  /*!< Min enumerator value of PIN6 field.                                  */
  #define GPIO_DIR_PIN6_Max (0x1UL)                  /*!< Max enumerator value of PIN6 field.                                  */
  #define GPIO_DIR_PIN6_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN6_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN7 @Bit 7 : Pin 7 */
  #define GPIO_DIR_PIN7_Pos (7UL)                    /*!< Position of PIN7 field.                                              */
  #define GPIO_DIR_PIN7_Msk (0x1UL << GPIO_DIR_PIN7_Pos) /*!< Bit mask of PIN7 field.                                          */
  #define GPIO_DIR_PIN7_Min (0x0UL)                  /*!< Min enumerator value of PIN7 field.                                  */
  #define GPIO_DIR_PIN7_Max (0x1UL)                  /*!< Max enumerator value of PIN7 field.                                  */
  #define GPIO_DIR_PIN7_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN7_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN8 @Bit 8 : Pin 8 */
  #define GPIO_DIR_PIN8_Pos (8UL)                    /*!< Position of PIN8 field.                                              */
  #define GPIO_DIR_PIN8_Msk (0x1UL << GPIO_DIR_PIN8_Pos) /*!< Bit mask of PIN8 field.                                          */
  #define GPIO_DIR_PIN8_Min (0x0UL)                  /*!< Min enumerator value of PIN8 field.                                  */
  #define GPIO_DIR_PIN8_Max (0x1UL)                  /*!< Max enumerator value of PIN8 field.                                  */
  #define GPIO_DIR_PIN8_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN8_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN9 @Bit 9 : Pin 9 */
  #define GPIO_DIR_PIN9_Pos (9UL)                    /*!< Position of PIN9 field.                                              */
  #define GPIO_DIR_PIN9_Msk (0x1UL << GPIO_DIR_PIN9_Pos) /*!< Bit mask of PIN9 field.                                          */
  #define GPIO_DIR_PIN9_Min (0x0UL)                  /*!< Min enumerator value of PIN9 field.                                  */
  #define GPIO_DIR_PIN9_Max (0x1UL)                  /*!< Max enumerator value of PIN9 field.                                  */
  #define GPIO_DIR_PIN9_Input (0x0UL)                /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN9_Output (0x1UL)               /*!< Pin set as output                                                    */

/* PIN10 @Bit 10 : Pin 10 */
  #define GPIO_DIR_PIN10_Pos (10UL)                  /*!< Position of PIN10 field.                                             */
  #define GPIO_DIR_PIN10_Msk (0x1UL << GPIO_DIR_PIN10_Pos) /*!< Bit mask of PIN10 field.                                       */
  #define GPIO_DIR_PIN10_Min (0x0UL)                 /*!< Min enumerator value of PIN10 field.                                 */
  #define GPIO_DIR_PIN10_Max (0x1UL)                 /*!< Max enumerator value of PIN10 field.                                 */
  #define GPIO_DIR_PIN10_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN10_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN11 @Bit 11 : Pin 11 */
  #define GPIO_DIR_PIN11_Pos (11UL)                  /*!< Position of PIN11 field.                                             */
  #define GPIO_DIR_PIN11_Msk (0x1UL << GPIO_DIR_PIN11_Pos) /*!< Bit mask of PIN11 field.                                       */
  #define GPIO_DIR_PIN11_Min (0x0UL)                 /*!< Min enumerator value of PIN11 field.                                 */
  #define GPIO_DIR_PIN11_Max (0x1UL)                 /*!< Max enumerator value of PIN11 field.                                 */
  #define GPIO_DIR_PIN11_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN11_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN12 @Bit 12 : Pin 12 */
  #define GPIO_DIR_PIN12_Pos (12UL)                  /*!< Position of PIN12 field.                                             */
  #define GPIO_DIR_PIN12_Msk (0x1UL << GPIO_DIR_PIN12_Pos) /*!< Bit mask of PIN12 field.                                       */
  #define GPIO_DIR_PIN12_Min (0x0UL)                 /*!< Min enumerator value of PIN12 field.                                 */
  #define GPIO_DIR_PIN12_Max (0x1UL)                 /*!< Max enumerator value of PIN12 field.                                 */
  #define GPIO_DIR_PIN12_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN12_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN13 @Bit 13 : Pin 13 */
  #define GPIO_DIR_PIN13_Pos (13UL)                  /*!< Position of PIN13 field.                                             */
  #define GPIO_DIR_PIN13_Msk (0x1UL << GPIO_DIR_PIN13_Pos) /*!< Bit mask of PIN13 field.                                       */
  #define GPIO_DIR_PIN13_Min (0x0UL)                 /*!< Min enumerator value of PIN13 field.                                 */
  #define GPIO_DIR_PIN13_Max (0x1UL)                 /*!< Max enumerator value of PIN13 field.                                 */
  #define GPIO_DIR_PIN13_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN13_Output (0x1UL)              /*!< Pin set as output                                                    */

/* PIN14 @Bit 14 : Pin 14 */
  #define GPIO_DIR_PIN14_Pos (14UL)                  /*!< Position of PIN14 field.                                             */
  #define GPIO_DIR_PIN14_Msk (0x1UL << GPIO_DIR_PIN14_Pos) /*!< Bit mask of PIN14 field.                                       */
  #define GPIO_DIR_PIN14_Min (0x0UL)                 /*!< Min enumerator value of PIN14 field.                                 */
  #define GPIO_DIR_PIN14_Max (0x1UL)                 /*!< Max enumerator value of PIN14 field.                                 */
  #define GPIO_DIR_PIN14_Input (0x0UL)               /*!< Pin set as input                                                     */
  #define GPIO_DIR_PIN14_Output (0x1UL)              /*!< Pin set as output                                                    */

