NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event RECEIVE[n] will publish to */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Msk (0xFFUL << PPIB_PUBLISH_RECEIVE_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define PPIB_PUBLISH_RECEIVE_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define PPIB_PUBLISH_RECEIVE_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define PPIB_PUBLISH_RECEIVE_EN_Msk (0x1UL << PPIB_PUBLISH_RECEIVE_EN_Pos) /*!< Bit mask of EN field.                        */
  #define PPIB_PUBLISH_RECEIVE_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define PPIB_PUBLISH_RECEIVE_EN_Disabled (0x0UL)   /*!< Disable publishing                                                   */
  #define PPIB_PUBLISH_RECEIVE_EN_Enabled (0x1UL)    /*!< Enable publishing                                                    */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           RADIO                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================== Struct RADIO_AUXDATA =================================================== */
/**
  * @brief AUXDATA [RADIO_AUXDATA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CNF[1];                            /*!< (@ 0x00000000) AUXDATA configuration                                 */
} NRF_RADIO_AUXDATA_Type;                            /*!< Size = 4 (0x004)                                                     */

/* RADIO_AUXDATA_CNF: AUXDATA configuration */
  #define RADIO_AUXDATA_CNF_MaxCount (1UL)           /*!< Max size of CNF[1] array.                                            */
  #define RADIO_AUXDATA_CNF_MaxIndex (0UL)           /*!< Max index of CNF[1] array.                                           */
  #define RADIO_AUXDATA_CNF_MinIndex (0UL)           /*!< Min index of CNF[1] array.                                           */
  #define RADIO_AUXDATA_CNF_ResetValue (0x00000000UL) /*!< Reset value of CNF[1] register.                                     */

/* ACQMODE @Bits 0..4 : Acquisition mode */
  #define RADIO_AUXDATA_CNF_ACQMODE_Pos (0UL)        /*!< Position of ACQMODE field.                                           */
  #define RADIO_AUXDATA_CNF_ACQMODE_Msk (0x1FUL << RADIO_AUXDATA_CNF_ACQMODE_Pos) /*!< Bit mask of ACQMODE field.              */
  #define RADIO_AUXDATA_CNF_ACQMODE_Min (0x07UL)     /*!< Min enumerator value of ACQMODE field.                               */
  #define RADIO_AUXDATA_CNF_ACQMODE_Max (0x07UL)     /*!< Max enumerator value of ACQMODE field.                               */
  #define RADIO_AUXDATA_CNF_ACQMODE_Rtt (0x07UL)     /*!< Baseband Channel Sounding RTT Data                                   */



/* ================================================= Struct RADIO_AUXDATADMA ================================================= */
/**
  * @brief AUXDATADMA [RADIO_AUXDATADMA] (unspecified)
  */
typedef struct {
  __IOM uint32_t  ENABLE;                            /*!< (@ 0x00000000) Enable or disable data acquisition                    */
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) DMA pointer                                           */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of 32-bit words to transfer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of 32-bit words transferred in the last
                                                                         transaction*/
} NRF_RADIO_AUXDATADMA_Type;                         /*!< Size = 16 (0x010)                                                    */
  #define RADIO_AUXDATADMA_MaxCount (1UL)            /*!< Size of AUXDATADMA[1] array.                                         */
  #define RADIO_AUXDATADMA_MaxIndex (0UL)            /*!< Max index of AUXDATADMA[1] array.                                    */
  #define RADIO_AUXDATADMA_MinIndex (0UL)            /*!< Min index of AUXDATADMA[1] array.                                    */

/* RADIO_AUXDATADMA_ENABLE: Enable or disable data acquisition */
  #define RADIO_AUXDATADMA_ENABLE_ResetValue (0x00000000UL) /*!< Reset value of ENABLE register.                               */

/* ENABLE @Bit 0 : Enable or disable data acquisition */
  #define RADIO_AUXDATADMA_ENABLE_ENABLE_Pos (0UL)   /*!< Position of ENABLE field.                                            */
  #define RADIO_AUXDATADMA_ENABLE_ENABLE_Msk (0x1UL << RADIO_AUXDATADMA_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.      */
  #define RADIO_AUXDATADMA_ENABLE_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                                */
  #define RADIO_AUXDATADMA_ENABLE_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                                */
  #define RADIO_AUXDATADMA_ENABLE_ENABLE_Disabled (0x0UL) /*!< Data acquisition is disabled                                    */
  #define RADIO_AUXDATADMA_ENABLE_ENABLE_Enabled (0x1UL) /*!< Data acquisition is enabled                                      */


/* RADIO_AUXDATADMA_PTR: DMA pointer */
  #define RADIO_AUXDATADMA_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                     */

/* PTR @Bits 0..31 : Data pointer */
  #define RADIO_AUXDATADMA_PTR_PTR_Pos (0UL)         /*!< Position of PTR field.                                               */
  #define RADIO_AUXDATADMA_PTR_PTR_Msk (0xFFFFFFFFUL << RADIO_AUXDATADMA_PTR_PTR_Pos) /*!< Bit mask of PTR field.              */


