NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* RADIO_TASKS_PLLEN: Enable RADIO in PLL mode (standby for either TX or RX) */
  #define RADIO_TASKS_PLLEN_ResetValue (0x00000000UL) /*!< Reset value of TASKS_PLLEN register.                                */

/* TASKS_PLLEN @Bit 0 : Enable RADIO in PLL mode (standby for either TX or RX) */
  #define RADIO_TASKS_PLLEN_TASKS_PLLEN_Pos (0UL)    /*!< Position of TASKS_PLLEN field.                                       */
  #define RADIO_TASKS_PLLEN_TASKS_PLLEN_Msk (0x1UL << RADIO_TASKS_PLLEN_TASKS_PLLEN_Pos) /*!< Bit mask of TASKS_PLLEN field.   */
  #define RADIO_TASKS_PLLEN_TASKS_PLLEN_Min (0x1UL)  /*!< Min enumerator value of TASKS_PLLEN field.                           */
  #define RADIO_TASKS_PLLEN_TASKS_PLLEN_Max (0x1UL)  /*!< Max enumerator value of TASKS_PLLEN field.                           */
  #define RADIO_TASKS_PLLEN_TASKS_PLLEN_Trigger (0x1UL) /*!< Trigger task                                                      */


/* RADIO_TASKS_CSTONESSTART: Start tone processing for channel sounding */
  #define RADIO_TASKS_CSTONESSTART_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CSTONESSTART register.                  */

/* TASKS_CSTONESSTART @Bit 0 : Start tone processing for channel sounding */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Pos (0UL) /*!< Position of TASKS_CSTONESSTART field.                     */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Msk (0x1UL << RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Pos) /*!< Bit
                                                                            mask of TASKS_CSTONESSTART field.*/
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Min (0x1UL) /*!< Min enumerator value of TASKS_CSTONESSTART field.       */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Max (0x1UL) /*!< Max enumerator value of TASKS_CSTONESSTART field.       */
  #define RADIO_TASKS_CSTONESSTART_TASKS_CSTONESSTART_Trigger (0x1UL) /*!< Trigger task                                        */


/* RADIO_TASKS_SOFTRESET: Reset all public registers, but with these exceptions: DMA registers and EVENT/INTEN/SUBSCRIBE/PUBLISH
                           registers. Only to be used in DISABLED state. */

  #define RADIO_TASKS_SOFTRESET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SOFTRESET register.                        */

/* TASKS_SOFTRESET @Bit 0 : Reset all public registers, but with these exceptions: DMA registers and
                            EVENT/INTEN/SUBSCRIBE/PUBLISH registers. Only to be used in DISABLED state. */

  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Pos (0UL) /*!< Position of TASKS_SOFTRESET field.                              */
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Msk (0x1UL << RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Pos) /*!< Bit mask of
                                                                            TASKS_SOFTRESET field.*/
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Min (0x1UL) /*!< Min enumerator value of TASKS_SOFTRESET field.                */
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Max (0x1UL) /*!< Max enumerator value of TASKS_SOFTRESET field.                */
  #define RADIO_TASKS_SOFTRESET_TASKS_SOFTRESET_Trigger (0x1UL) /*!< Trigger task                                              */


/* RADIO_SUBSCRIBE_TXEN: Subscribe configuration for task TXEN */
  #define RADIO_SUBSCRIBE_TXEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_TXEN register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task TXEN will subscribe to */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_TXEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_TXEN_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_TXEN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_TXEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_TXEN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_SUBSCRIBE_TXEN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_TXEN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_TXEN_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_TXEN_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_RXEN: Subscribe configuration for task RXEN */
  #define RADIO_SUBSCRIBE_RXEN_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_RXEN register.                          */

/* CHIDX @Bits 0..7 : DPPI channel that task RXEN will subscribe to */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Pos (0UL)       /*!< Position of CHIDX field.                                             */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_RXEN_CHIDX_Pos) /*!< Bit mask of CHIDX field.              */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Min (0x00UL)    /*!< Min value of CHIDX field.                                            */
  #define RADIO_SUBSCRIBE_RXEN_CHIDX_Max (0xFFUL)    /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define RADIO_SUBSCRIBE_RXEN_EN_Pos (31UL)         /*!< Position of EN field.                                                */
  #define RADIO_SUBSCRIBE_RXEN_EN_Msk (0x1UL << RADIO_SUBSCRIBE_RXEN_EN_Pos) /*!< Bit mask of EN field.                        */
  #define RADIO_SUBSCRIBE_RXEN_EN_Min (0x0UL)        /*!< Min enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RXEN_EN_Max (0x1UL)        /*!< Max enumerator value of EN field.                                    */
  #define RADIO_SUBSCRIBE_RXEN_EN_Disabled (0x0UL)   /*!< Disable subscription                                                 */
  #define RADIO_SUBSCRIBE_RXEN_EN_Enabled (0x1UL)    /*!< Enable subscription                                                  */


/* RADIO_SUBSCRIBE_START: Subscribe configuration for task START */
  #define RADIO_SUBSCRIBE_START_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE_START register.                        */

