NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* EDSTOPPED @Bit 16 : Write '1' to enable interrupt for event EDSTOPPED */
  #define RADIO_INTENSET00_EDSTOPPED_Pos (16UL)      /*!< Position of EDSTOPPED field.                                         */
  #define RADIO_INTENSET00_EDSTOPPED_Msk (0x1UL << RADIO_INTENSET00_EDSTOPPED_Pos) /*!< Bit mask of EDSTOPPED field.           */
  #define RADIO_INTENSET00_EDSTOPPED_Min (0x0UL)     /*!< Min enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTENSET00_EDSTOPPED_Max (0x1UL)     /*!< Max enumerator value of EDSTOPPED field.                             */
  #define RADIO_INTENSET00_EDSTOPPED_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET00_EDSTOPPED_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET00_EDSTOPPED_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* CCAIDLE @Bit 17 : Write '1' to enable interrupt for event CCAIDLE */
  #define RADIO_INTENSET00_CCAIDLE_Pos (17UL)        /*!< Position of CCAIDLE field.                                           */
  #define RADIO_INTENSET00_CCAIDLE_Msk (0x1UL << RADIO_INTENSET00_CCAIDLE_Pos) /*!< Bit mask of CCAIDLE field.                 */
  #define RADIO_INTENSET00_CCAIDLE_Min (0x0UL)       /*!< Min enumerator value of CCAIDLE field.                               */
  #define RADIO_INTENSET00_CCAIDLE_Max (0x1UL)       /*!< Max enumerator value of CCAIDLE field.                               */
  #define RADIO_INTENSET00_CCAIDLE_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET00_CCAIDLE_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET00_CCAIDLE_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CCABUSY @Bit 18 : Write '1' to enable interrupt for event CCABUSY */
  #define RADIO_INTENSET00_CCABUSY_Pos (18UL)        /*!< Position of CCABUSY field.                                           */
  #define RADIO_INTENSET00_CCABUSY_Msk (0x1UL << RADIO_INTENSET00_CCABUSY_Pos) /*!< Bit mask of CCABUSY field.                 */
  #define RADIO_INTENSET00_CCABUSY_Min (0x0UL)       /*!< Min enumerator value of CCABUSY field.                               */
  #define RADIO_INTENSET00_CCABUSY_Max (0x1UL)       /*!< Max enumerator value of CCABUSY field.                               */
  #define RADIO_INTENSET00_CCABUSY_Set (0x1UL)       /*!< Enable                                                               */
  #define RADIO_INTENSET00_CCABUSY_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET00_CCABUSY_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* CCASTOPPED @Bit 19 : Write '1' to enable interrupt for event CCASTOPPED */
  #define RADIO_INTENSET00_CCASTOPPED_Pos (19UL)     /*!< Position of CCASTOPPED field.                                        */
  #define RADIO_INTENSET00_CCASTOPPED_Msk (0x1UL << RADIO_INTENSET00_CCASTOPPED_Pos) /*!< Bit mask of CCASTOPPED field.        */
  #define RADIO_INTENSET00_CCASTOPPED_Min (0x0UL)    /*!< Min enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTENSET00_CCASTOPPED_Max (0x1UL)    /*!< Max enumerator value of CCASTOPPED field.                            */
  #define RADIO_INTENSET00_CCASTOPPED_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET00_CCASTOPPED_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET00_CCASTOPPED_Enabled (0x1UL) /*!< Read: Enabled                                                       */

/* RATEBOOST @Bit 20 : Write '1' to enable interrupt for event RATEBOOST */
  #define RADIO_INTENSET00_RATEBOOST_Pos (20UL)      /*!< Position of RATEBOOST field.                                         */
  #define RADIO_INTENSET00_RATEBOOST_Msk (0x1UL << RADIO_INTENSET00_RATEBOOST_Pos) /*!< Bit mask of RATEBOOST field.           */
  #define RADIO_INTENSET00_RATEBOOST_Min (0x0UL)     /*!< Min enumerator value of RATEBOOST field.                             */
  #define RADIO_INTENSET00_RATEBOOST_Max (0x1UL)     /*!< Max enumerator value of RATEBOOST field.                             */
  #define RADIO_INTENSET00_RATEBOOST_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET00_RATEBOOST_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET00_RATEBOOST_Enabled (0x1UL) /*!< Read: Enabled                                                        */

/* MHRMATCH @Bit 21 : Write '1' to enable interrupt for event MHRMATCH */
  #define RADIO_INTENSET00_MHRMATCH_Pos (21UL)       /*!< Position of MHRMATCH field.                                          */
  #define RADIO_INTENSET00_MHRMATCH_Msk (0x1UL << RADIO_INTENSET00_MHRMATCH_Pos) /*!< Bit mask of MHRMATCH field.              */
  #define RADIO_INTENSET00_MHRMATCH_Min (0x0UL)      /*!< Min enumerator value of MHRMATCH field.                              */
  #define RADIO_INTENSET00_MHRMATCH_Max (0x1UL)      /*!< Max enumerator value of MHRMATCH field.                              */
  #define RADIO_INTENSET00_MHRMATCH_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET00_MHRMATCH_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET00_MHRMATCH_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* SYNC @Bit 22 : Write '1' to enable interrupt for event SYNC */
  #define RADIO_INTENSET00_SYNC_Pos (22UL)           /*!< Position of SYNC field.                                              */
  #define RADIO_INTENSET00_SYNC_Msk (0x1UL << RADIO_INTENSET00_SYNC_Pos) /*!< Bit mask of SYNC field.                          */
  #define RADIO_INTENSET00_SYNC_Min (0x0UL)          /*!< Min enumerator value of SYNC field.                                  */
  #define RADIO_INTENSET00_SYNC_Max (0x1UL)          /*!< Max enumerator value of SYNC field.                                  */
  #define RADIO_INTENSET00_SYNC_Set (0x1UL)          /*!< Enable                                                               */
  #define RADIO_INTENSET00_SYNC_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET00_SYNC_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* CTEPRESENT @Bit 23 : Write '1' to enable interrupt for event CTEPRESENT */
  #define RADIO_INTENSET00_CTEPRESENT_Pos (23UL)     /*!< Position of CTEPRESENT field.                                        */
  #define RADIO_INTENSET00_CTEPRESENT_Msk (0x1UL << RADIO_INTENSET00_CTEPRESENT_Pos) /*!< Bit mask of CTEPRESENT field.        */
  #define RADIO_INTENSET00_CTEPRESENT_Min (0x0UL)    /*!< Min enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTENSET00_CTEPRESENT_Max (0x1UL)    /*!< Max enumerator value of CTEPRESENT field.                            */
  #define RADIO_INTENSET00_CTEPRESENT_Set (0x1UL)    /*!< Enable                                                               */
  #define RADIO_INTENSET00_CTEPRESENT_Disabled (0x0UL) /*!< Read: Disabled                                                     */
  #define RADIO_INTENSET00_CTEPRESENT_Enabled (0x1UL) /*!< Read: Enabled                                                       */


/* RADIO_INTENSET01: Enable interrupt */
  #define RADIO_INTENSET01_ResetValue (0x00000000UL) /*!< Reset value of INTENSET01 register.                                  */

/* PLLREADY @Bit 12 : Write '1' to enable interrupt for event PLLREADY */
  #define RADIO_INTENSET01_PLLREADY_Pos (12UL)       /*!< Position of PLLREADY field.                                          */
  #define RADIO_INTENSET01_PLLREADY_Msk (0x1UL << RADIO_INTENSET01_PLLREADY_Pos) /*!< Bit mask of PLLREADY field.              */
  #define RADIO_INTENSET01_PLLREADY_Min (0x0UL)      /*!< Min enumerator value of PLLREADY field.                              */
  #define RADIO_INTENSET01_PLLREADY_Max (0x1UL)      /*!< Max enumerator value of PLLREADY field.                              */
  #define RADIO_INTENSET01_PLLREADY_Set (0x1UL)      /*!< Enable                                                               */
  #define RADIO_INTENSET01_PLLREADY_Disabled (0x0UL) /*!< Read: Disabled                                                       */
  #define RADIO_INTENSET01_PLLREADY_Enabled (0x1UL)  /*!< Read: Enabled                                                        */

/* RXADDRESS @Bit 15 : Write '1' to enable interrupt for event RXADDRESS */
  #define RADIO_INTENSET01_RXADDRESS_Pos (15UL)      /*!< Position of RXADDRESS field.                                         */
  #define RADIO_INTENSET01_RXADDRESS_Msk (0x1UL << RADIO_INTENSET01_RXADDRESS_Pos) /*!< Bit mask of RXADDRESS field.           */
  #define RADIO_INTENSET01_RXADDRESS_Min (0x0UL)     /*!< Min enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET01_RXADDRESS_Max (0x1UL)     /*!< Max enumerator value of RXADDRESS field.                             */
  #define RADIO_INTENSET01_RXADDRESS_Set (0x1UL)     /*!< Enable                                                               */
  #define RADIO_INTENSET01_RXADDRESS_Disabled (0x0UL) /*!< Read: Disabled                                                      */
  #define RADIO_INTENSET01_RXADDRESS_Enabled (0x1UL) /*!< Read: Enabled                                                        */

