NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* VREFPLPFDISABLE @Bit 1 : Disable the internal low pass filter for the reference voltage */
  #define SAADC_CH_CONFIG_VREFPLPFDISABLE_Pos (1UL)  /*!< Position of VREFPLPFDISABLE field.                                   */
  #define SAADC_CH_CONFIG_VREFPLPFDISABLE_Msk (0x1UL << SAADC_CH_CONFIG_VREFPLPFDISABLE_Pos) /*!< Bit mask of VREFPLPFDISABLE
                                                                            field.*/
  #define SAADC_CH_CONFIG_VREFPLPFDISABLE_Min (0x0UL) /*!< Min enumerator value of VREFPLPFDISABLE field.                      */
  #define SAADC_CH_CONFIG_VREFPLPFDISABLE_Max (0x1UL) /*!< Max enumerator value of VREFPLPFDISABLE field.                      */
  #define SAADC_CH_CONFIG_VREFPLPFDISABLE_Disabled (0x1UL) /*!< The internal low pass filter for the reference voltage is
                                                                disabled (reference voltage is unfiltered and has faster
                                                                settling time)*/
  #define SAADC_CH_CONFIG_VREFPLPFDISABLE_Enabled (0x0UL) /*!< The internal low pass filter for the reference voltage is enabled
                                                               (reference voltage is filtered)*/

/* HIGHSPEED @Bit 4 : Enable high speed inputs for the ADC, allowing the highest sampling bandwidth */
  #define SAADC_CH_CONFIG_HIGHSPEED_Pos (4UL)        /*!< Position of HIGHSPEED field.                                         */
  #define SAADC_CH_CONFIG_HIGHSPEED_Msk (0x1UL << SAADC_CH_CONFIG_HIGHSPEED_Pos) /*!< Bit mask of HIGHSPEED field.             */
  #define SAADC_CH_CONFIG_HIGHSPEED_Min (0x0UL)      /*!< Min enumerator value of HIGHSPEED field.                             */
  #define SAADC_CH_CONFIG_HIGHSPEED_Max (0x1UL)      /*!< Max enumerator value of HIGHSPEED field.                             */
  #define SAADC_CH_CONFIG_HIGHSPEED_Disabled (0x0UL) /*!< High speed inputs are disabled                                       */
  #define SAADC_CH_CONFIG_HIGHSPEED_Enabled (0x1UL)  /*!< High speed inputs are enabled                                        */

/* REFSEL @Bits 12..14 : Reference control */
  #define SAADC_CH_CONFIG_REFSEL_Pos (12UL)          /*!< Position of REFSEL field.                                            */
  #define SAADC_CH_CONFIG_REFSEL_Msk (0x7UL << SAADC_CH_CONFIG_REFSEL_Pos) /*!< Bit mask of REFSEL field.                      */
  #define SAADC_CH_CONFIG_REFSEL_Min (0x0UL)         /*!< Min enumerator value of REFSEL field.                                */
  #define SAADC_CH_CONFIG_REFSEL_Max (0x2UL)         /*!< Max enumerator value of REFSEL field.                                */
  #define SAADC_CH_CONFIG_REFSEL_Internal (0x0UL)    /*!< Internal 1.3 V reference                                             */
  #define SAADC_CH_CONFIG_REFSEL_External (0x1UL)    /*!< External reference voltage                                           */
  #define SAADC_CH_CONFIG_REFSEL_VddL (0x2UL)        /*!< Reference given at VDDL                                              */

/* MODE @Bit 15 : Enable differential mode */
  #define SAADC_CH_CONFIG_MODE_Pos (15UL)            /*!< Position of MODE field.                                              */
  #define SAADC_CH_CONFIG_MODE_Msk (0x1UL << SAADC_CH_CONFIG_MODE_Pos) /*!< Bit mask of MODE field.                            */
  #define SAADC_CH_CONFIG_MODE_Min (0x0UL)           /*!< Min enumerator value of MODE field.                                  */
  #define SAADC_CH_CONFIG_MODE_Max (0x1UL)           /*!< Max enumerator value of MODE field.                                  */
  #define SAADC_CH_CONFIG_MODE_SE (0x0UL)            /*!< Single ended, PSELN will be ignored, negative input to ADC shorted to
                                                          GND*/
  #define SAADC_CH_CONFIG_MODE_Diff (0x1UL)          /*!< Differential                                                         */

/* TACQ @Bits 16..24 : Acquisition time, the time the ADC uses to sample the input voltage. Resulting acquistion time is
                       ((TACQ+1) x 125 ns) */

  #define SAADC_CH_CONFIG_TACQ_Pos (16UL)            /*!< Position of TACQ field.                                              */
  #define SAADC_CH_CONFIG_TACQ_Msk (0x1FFUL << SAADC_CH_CONFIG_TACQ_Pos) /*!< Bit mask of TACQ field.                          */
  #define SAADC_CH_CONFIG_TACQ_Min (0x003UL)         /*!< Min value of TACQ field.                                             */
  #define SAADC_CH_CONFIG_TACQ_Max (0x13FUL)         /*!< Max size of TACQ field.                                              */

/* TCONV @Bits 28..30 : Conversion time. Resulting conversion time is ((TCONV+1) x 250 ns) */
  #define SAADC_CH_CONFIG_TCONV_Pos (28UL)           /*!< Position of TCONV field.                                             */
  #define SAADC_CH_CONFIG_TCONV_Msk (0x7UL << SAADC_CH_CONFIG_TCONV_Pos) /*!< Bit mask of TCONV field.                         */
  #define SAADC_CH_CONFIG_TCONV_Min (0x1UL)          /*!< Min value of TCONV field.                                            */
  #define SAADC_CH_CONFIG_TCONV_Max (0x7UL)          /*!< Max size of TCONV field.                                             */


/* SAADC_CH_LIMIT: High/low limits for event monitoring a channel */
  #define SAADC_CH_LIMIT_ResetValue (0x7FFF8000UL)   /*!< Reset value of LIMIT register.                                       */

/* LOW @Bits 0..15 : Low level limit */
  #define SAADC_CH_LIMIT_LOW_Pos (0UL)               /*!< Position of LOW field.                                               */
  #define SAADC_CH_LIMIT_LOW_Msk (0xFFFFUL << SAADC_CH_LIMIT_LOW_Pos) /*!< Bit mask of LOW field.                              */

/* HIGH @Bits 16..31 : High level limit */
  #define SAADC_CH_LIMIT_HIGH_Pos (16UL)             /*!< Position of HIGH field.                                              */
  #define SAADC_CH_LIMIT_HIGH_Msk (0xFFFFUL << SAADC_CH_LIMIT_HIGH_Pos) /*!< Bit mask of HIGH field.                           */



/* =================================================== Struct SAADC_RESULT =================================================== */
/**
  * @brief RESULT [SAADC_RESULT] RESULT EasyDMA channel
  */
typedef struct {
  __IM  uint32_t  RESERVED;
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000004) Data pointer                                          */
  __IOM uint32_t  MAXCNT;                            /*!< (@ 0x00000008) Maximum number of buffer bytes to transfer            */
  __IM  uint32_t  AMOUNT;                            /*!< (@ 0x0000000C) Number of buffer bytes transferred since last START,
                                                                         updated after the END or STOPPED events*/
  __IM  uint32_t  CURRENTAMOUNT;                     /*!< (@ 0x00000010) Number of buffer bytes transferred since last START,
                                                                         continuously updated*/
} NRF_SAADC_RESULT_Type;                             /*!< Size = 20 (0x014)                                                    */

/* SAADC_RESULT_PTR: Data pointer */
  #define SAADC_RESULT_PTR_ResetValue (0x00000000UL) /*!< Reset value of PTR register.                                         */

/* PTR @Bits 0..15 : Data pointer */
  #define SAADC_RESULT_PTR_PTR_Pos (0UL)             /*!< Position of PTR field.                                               */
  #define SAADC_RESULT_PTR_PTR_Msk (0xFFFFUL << SAADC_RESULT_PTR_PTR_Pos) /*!< Bit mask of PTR field.                          */


/* SAADC_RESULT_MAXCNT: Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_ResetValue (0x00000000UL) /*!< Reset value of MAXCNT register.                                   */

/* MAXCNT @Bits 0..14 : Maximum number of buffer bytes to transfer */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Pos (0UL)       /*!< Position of MAXCNT field.                                            */
  #define SAADC_RESULT_MAXCNT_MAXCNT_Msk (0x7FFFUL << SAADC_RESULT_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field.           */


/* SAADC_RESULT_AMOUNT: Number of buffer bytes transferred since last START, updated after the END or STOPPED events */
  #define SAADC_RESULT_AMOUNT_ResetValue (0x00000000UL) /*!< Reset value of AMOUNT register.                                   */

/* AMOUNT @Bits 0..14 : Number of buffer bytes transferred since last START, updated after the END or STOPPED events. */
  #define SAADC_RESULT_AMOUNT_AMOUNT_Pos (0UL)       /*!< Position of AMOUNT field.                                            */
  #define SAADC_RESULT_AMOUNT_AMOUNT_Msk (0x7FFFUL << SAADC_RESULT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field.           */


/* SAADC_RESULT_CURRENTAMOUNT: Number of buffer bytes transferred since last START, continuously updated */
  #define SAADC_RESULT_CURRENTAMOUNT_ResetValue (0x00000000UL) /*!< Reset value of CURRENTAMOUNT register.                     */

/* AMOUNT @Bits 0..14 : Number of buffer bytes transferred since last START, continuously updated. */
  #define SAADC_RESULT_CURRENTAMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field.                                           */
  #define SAADC_RESULT_CURRENTAMOUNT_AMOUNT_Msk (0x7FFFUL << SAADC_RESULT_CURRENTAMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT
                                                                            field.*/


/* ====================================================== Struct SAADC ======================================================= */
/**
  * @brief Analog to Digital Converter
  */
  typedef struct {                                   /*!< SAADC Structure                                                      */
    __OM uint32_t TASKS_START;                       /*!< (@ 0x00000000) Start the ADC and prepare the result buffer in RAM    */
    __OM uint32_t TASKS_SAMPLE;                      /*!< (@ 0x00000004) Take one ADC sample, if scan is enabled all channels
                                                                         are sampled. This task requires that SAADC has started,
                                                                         i.e. EVENTS_STARTED was set and EVENTS_STOPPED was
                                                                         not.*/
    __OM uint32_t TASKS_STOP;                        /*!< (@ 0x00000008) Stop the ADC and terminate any on-going conversion    */
    __OM uint32_t TASKS_CALIBRATEOFFSET;             /*!< (@ 0x0000000C) Starts offset auto-calibration                        */
    __IM uint32_t RESERVED[28];
    __IOM uint32_t SUBSCRIBE_START;                  /*!< (@ 0x00000080) Subscribe configuration for task START                */
    __IOM uint32_t SUBSCRIBE_SAMPLE;                 /*!< (@ 0x00000084) Subscribe configuration for task SAMPLE               */
    __IOM uint32_t SUBSCRIBE_STOP;                   /*!< (@ 0x00000088) Subscribe configuration for task STOP                 */
    __IOM uint32_t SUBSCRIBE_CALIBRATEOFFSET;        /*!< (@ 0x0000008C) Subscribe configuration for task CALIBRATEOFFSET      */
    __IM uint32_t RESERVED1[28];
    __IOM uint32_t EVENTS_STARTED;                   /*!< (@ 0x00000100) The ADC has started                                   */
    __IOM uint32_t EVENTS_END;                       /*!< (@ 0x00000104) The ADC has filled up the Result buffer               */
    __IOM uint32_t EVENTS_DONE;                      /*!< (@ 0x00000108) A conversion task has been completed. Depending on the
                                                                         mode, multiple conversions might be needed for a result
                                                                         to be transferred to RAM.*/
    __IOM uint32_t EVENTS_RESULTDONE;                /*!< (@ 0x0000010C) A result is ready to get transferred to RAM.          */
    __IOM uint32_t EVENTS_CALIBRATEDONE;             /*!< (@ 0x00000110) Calibration is complete                               */
    __IOM uint32_t EVENTS_STOPPED;                   /*!< (@ 0x00000114) The ADC has stopped                                   */
    __IOM NRF_SAADC_EVENTS_CH_Type EVENTS_CH[4];     /*!< (@ 0x00000118) Peripheral events.                                    */
    __IM uint32_t RESERVED2[18];
    __IOM uint32_t PUBLISH_STARTED;                  /*!< (@ 0x00000180) Publish configuration for event STARTED               */
    __IOM uint32_t PUBLISH_END;                      /*!< (@ 0x00000184) Publish configuration for event END                   */
    __IOM uint32_t PUBLISH_DONE;                     /*!< (@ 0x00000188) Publish configuration for event DONE                  */
    __IOM uint32_t PUBLISH_RESULTDONE;               /*!< (@ 0x0000018C) Publish configuration for event RESULTDONE            */
    __IOM uint32_t PUBLISH_CALIBRATEDONE;            /*!< (@ 0x00000190) Publish configuration for event CALIBRATEDONE         */
    __IOM uint32_t PUBLISH_STOPPED;                  /*!< (@ 0x00000194) Publish configuration for event STOPPED               */
    __IOM NRF_SAADC_PUBLISH_CH_Type PUBLISH_CH[4];   /*!< (@ 0x00000198) Publish configuration for events                      */
    __IM uint32_t RESERVED3[82];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED4[61];
    __IM uint32_t STATUS;                            /*!< (@ 0x00000400) Status                                                */
    __IM uint32_t RESERVED5[63];
    __IOM uint32_t ENABLE;                           /*!< (@ 0x00000500) Enable or disable ADC                                 */
    __IM uint32_t RESERVED6[3];
    __IOM NRF_SAADC_CH_Type CH[4];                   /*!< (@ 0x00000510) (unspecified)                                         */
    __IM uint32_t RESERVED7[38];
    __IOM uint32_t BURST;                            /*!< (@ 0x000005E8) Enable burst mode                                     */
    __IM uint32_t RESERVED8;
    __IOM uint32_t RESOLUTION;                       /*!< (@ 0x000005F0) Resolution configuration                              */
    __IOM uint32_t OVERSAMPLE;                       /*!< (@ 0x000005F4) Oversampling configuration. OVERSAMPLE should not be
                                                                         combined with SCAN. The RESOLUTION is applied before
                                                                         averaging, thus for high OVERSAMPLE a higher RESOLUTION
                                                                         should be used.*/
    __IOM uint32_t SAMPLERATE;                       /*!< (@ 0x000005F8) Controls normal or continuous sample rate             */
    __IM uint32_t RESERVED9[11];
    __IOM NRF_SAADC_RESULT_Type RESULT;              /*!< (@ 0x00000628) RESULT EasyDMA channel                                */
  } NRF_SAADC_Type;                                  /*!< Size = 1596 (0x63C)                                                  */

/* SAADC_TASKS_START: Start the ADC and prepare the result buffer in RAM */
  #define SAADC_TASKS_START_ResetValue (0x00000000UL) /*!< Reset value of TASKS_START register.                                */

/* TASKS_START @Bit 0 : Start the ADC and prepare the result buffer in RAM */
  #define SAADC_TASKS_START_TASKS_START_Pos (0UL)    /*!< Position of TASKS_START field.                                       */
  #define SAADC_TASKS_START_TASKS_START_Msk (0x1UL << SAADC_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field.   */
  #define SAADC_TASKS_START_TASKS_START_Min (0x1UL)  /*!< Min enumerator value of TASKS_START field.                           */
  #define SAADC_TASKS_START_TASKS_START_Max (0x1UL)  /*!< Max enumerator value of TASKS_START field.                           */
  #define SAADC_TASKS_START_TASKS_START_Trigger (0x1UL) /*!< Trigger task                                                      */


/* SAADC_TASKS_SAMPLE: Take one ADC sample, if scan is enabled all channels are sampled. This task requires that SAADC has
                        started, i.e. EVENTS_STARTED was set and EVENTS_STOPPED was not. */

  #define SAADC_TASKS_SAMPLE_ResetValue (0x00000000UL) /*!< Reset value of TASKS_SAMPLE register.                              */

/* TASKS_SAMPLE @Bit 0 : Take one ADC sample, if scan is enabled all channels are sampled. This task requires that SAADC has
                         started, i.e. EVENTS_STARTED was set and EVENTS_STOPPED was not. */

  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos (0UL)  /*!< Position of TASKS_SAMPLE field.                                      */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Msk (0x1UL << SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Pos) /*!< Bit mask of TASKS_SAMPLE
                                                                            field.*/
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Min (0x1UL) /*!< Min enumerator value of TASKS_SAMPLE field.                         */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Max (0x1UL) /*!< Max enumerator value of TASKS_SAMPLE field.                         */
  #define SAADC_TASKS_SAMPLE_TASKS_SAMPLE_Trigger (0x1UL) /*!< Trigger task                                                    */


/* SAADC_TASKS_STOP: Stop the ADC and terminate any on-going conversion */
  #define SAADC_TASKS_STOP_ResetValue (0x00000000UL) /*!< Reset value of TASKS_STOP register.                                  */

/* TASKS_STOP @Bit 0 : Stop the ADC and terminate any on-going conversion */
  #define SAADC_TASKS_STOP_TASKS_STOP_Pos (0UL)      /*!< Position of TASKS_STOP field.                                        */
  #define SAADC_TASKS_STOP_TASKS_STOP_Msk (0x1UL << SAADC_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field.        */
  #define SAADC_TASKS_STOP_TASKS_STOP_Min (0x1UL)    /*!< Min enumerator value of TASKS_STOP field.                            */
  #define SAADC_TASKS_STOP_TASKS_STOP_Max (0x1UL)    /*!< Max enumerator value of TASKS_STOP field.                            */
  #define SAADC_TASKS_STOP_TASKS_STOP_Trigger (0x1UL) /*!< Trigger task                                                        */


/* SAADC_TASKS_CALIBRATEOFFSET: Starts offset auto-calibration */
  #define SAADC_TASKS_CALIBRATEOFFSET_ResetValue (0x00000000UL) /*!< Reset value of TASKS_CALIBRATEOFFSET register.            */

