NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* OVERRUN @Bit 0 : Overrun error */
  #define TWIM_ERRORSRC_OVERRUN_Pos (0UL)            /*!< Position of OVERRUN field.                                           */
  #define TWIM_ERRORSRC_OVERRUN_Msk (0x1UL << TWIM_ERRORSRC_OVERRUN_Pos) /*!< Bit mask of OVERRUN field.                       */
  #define TWIM_ERRORSRC_OVERRUN_Min (0x0UL)          /*!< Min enumerator value of OVERRUN field.                               */
  #define TWIM_ERRORSRC_OVERRUN_Max (0x1UL)          /*!< Max enumerator value of OVERRUN field.                               */
  #define TWIM_ERRORSRC_OVERRUN_NotReceived (0x0UL)  /*!< Error did not occur                                                  */
  #define TWIM_ERRORSRC_OVERRUN_Received (0x1UL)     /*!< Error occurred                                                       */

/* ANACK @Bit 1 : NACK received after sending the address (write '1' to clear) */
  #define TWIM_ERRORSRC_ANACK_Pos (1UL)              /*!< Position of ANACK field.                                             */
  #define TWIM_ERRORSRC_ANACK_Msk (0x1UL << TWIM_ERRORSRC_ANACK_Pos) /*!< Bit mask of ANACK field.                             */
  #define TWIM_ERRORSRC_ANACK_Min (0x0UL)            /*!< Min enumerator value of ANACK field.                                 */
  #define TWIM_ERRORSRC_ANACK_Max (0x1UL)            /*!< Max enumerator value of ANACK field.                                 */
  #define TWIM_ERRORSRC_ANACK_NotReceived (0x0UL)    /*!< Error did not occur                                                  */
  #define TWIM_ERRORSRC_ANACK_Received (0x1UL)       /*!< Error occurred                                                       */

/* DNACK @Bit 2 : NACK received after sending a data byte (write '1' to clear) */
  #define TWIM_ERRORSRC_DNACK_Pos (2UL)              /*!< Position of DNACK field.                                             */
  #define TWIM_ERRORSRC_DNACK_Msk (0x1UL << TWIM_ERRORSRC_DNACK_Pos) /*!< Bit mask of DNACK field.                             */
  #define TWIM_ERRORSRC_DNACK_Min (0x0UL)            /*!< Min enumerator value of DNACK field.                                 */
  #define TWIM_ERRORSRC_DNACK_Max (0x1UL)            /*!< Max enumerator value of DNACK field.                                 */
  #define TWIM_ERRORSRC_DNACK_NotReceived (0x0UL)    /*!< Error did not occur                                                  */
  #define TWIM_ERRORSRC_DNACK_Received (0x1UL)       /*!< Error occurred                                                       */


/* TWIM_ENABLE: Enable TWIM */
  #define TWIM_ENABLE_ResetValue (0x00000000UL)      /*!< Reset value of ENABLE register.                                      */

/* ENABLE @Bits 0..3 : Enable or disable TWIM */
  #define TWIM_ENABLE_ENABLE_Pos (0UL)               /*!< Position of ENABLE field.                                            */
  #define TWIM_ENABLE_ENABLE_Msk (0xFUL << TWIM_ENABLE_ENABLE_Pos) /*!< Bit mask of ENABLE field.                              */
  #define TWIM_ENABLE_ENABLE_Min (0x0UL)             /*!< Min enumerator value of ENABLE field.                                */
  #define TWIM_ENABLE_ENABLE_Max (0x6UL)             /*!< Max enumerator value of ENABLE field.                                */
  #define TWIM_ENABLE_ENABLE_Disabled (0x0UL)        /*!< Disable TWIM                                                         */
  #define TWIM_ENABLE_ENABLE_Enabled (0x6UL)         /*!< Enable TWIM                                                          */


/* TWIM_FREQUENCY: TWI frequency. Accuracy depends on the HFCLK source selected. */
  #define TWIM_FREQUENCY_ResetValue (0x04000000UL)   /*!< Reset value of FREQUENCY register.                                   */

/* FREQUENCY @Bits 0..31 : TWI master clock frequency */
  #define TWIM_FREQUENCY_FREQUENCY_Pos (0UL)         /*!< Position of FREQUENCY field.                                         */
  #define TWIM_FREQUENCY_FREQUENCY_Msk (0xFFFFFFFFUL << TWIM_FREQUENCY_FREQUENCY_Pos) /*!< Bit mask of FREQUENCY field.        */
  #define TWIM_FREQUENCY_FREQUENCY_Min (0x01980000UL) /*!< Min enumerator value of FREQUENCY field.                            */
  #define TWIM_FREQUENCY_FREQUENCY_Max (0x0FF00000UL) /*!< Max enumerator value of FREQUENCY field.                            */
  #define TWIM_FREQUENCY_FREQUENCY_K100 (0x01980000UL) /*!< 100 kbps                                                           */
  #define TWIM_FREQUENCY_FREQUENCY_K250 (0x04000000UL) /*!< 250 kbps                                                           */
  #define TWIM_FREQUENCY_FREQUENCY_K400 (0x06400000UL) /*!< 400 kbps                                                           */
  #define TWIM_FREQUENCY_FREQUENCY_K1000 (0x0FF00000UL) /*!< 1000 kbps                                                         */


/* TWIM_ADDRESS: Address used in the TWI transfer */
  #define TWIM_ADDRESS_ResetValue (0x00000000UL)     /*!< Reset value of ADDRESS register.                                     */

/* ADDRESS @Bits 0..6 : Address used in the TWI transfer */
  #define TWIM_ADDRESS_ADDRESS_Pos (0UL)             /*!< Position of ADDRESS field.                                           */
  #define TWIM_ADDRESS_ADDRESS_Msk (0x7FUL << TWIM_ADDRESS_ADDRESS_Pos) /*!< Bit mask of ADDRESS field.                        */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           TWIS                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */

/* ================================================ Struct TWIS_TASKS_DMA_RX ================================================= */
/**
  * @brief RX [TWIS_TASKS_DMA_RX] Peripheral tasks.
  */
typedef struct {
  __OM  uint32_t  ENABLEMATCH[4];                    /*!< (@ 0x00000000) Enables the MATCH[n] event by setting the ENABLE[n] bit
                                                                         in the CONFIG register.*/
  __OM  uint32_t  DISABLEMATCH[4];                   /*!< (@ 0x00000010) Disables the MATCH[n] event by clearing the ENABLE[n]
                                                                         bit in the CONFIG register.*/
} NRF_TWIS_TASKS_DMA_RX_Type;                        /*!< Size = 32 (0x020)                                                    */

