NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* VAL @Bits 0..31 : VPR pins used for Real Time Peripherals VIO */
  #define VPRCSR_NORDIC_VIOPINS_VAL_Pos (0UL)        /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_VIOPINS_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_VIOPINS_VAL_Pos) /*!< Bit mask of VAL field.            */


/**
  * @brief EXTPARAMS [VPRCSR_NORDIC_EXTPARAMS] Reads values of external configuration parameters
  */
  #define VPRCSR_NORDIC_EXTPARAMS (0x000007C4ul)
  #define VPRCSR_NORDIC_EXTPARAMS_ResetValue (0x0000000EUL) /*!< Reset value of EXTPARAMS register.                            */

/* MULDIV @Bits 0..1 : value of MULDIV */
  #define VPRCSR_NORDIC_EXTPARAMS_MULDIV_Pos (0UL)   /*!< Position of MULDIV field.                                            */
  #define VPRCSR_NORDIC_EXTPARAMS_MULDIV_Msk (0x3UL << VPRCSR_NORDIC_EXTPARAMS_MULDIV_Pos) /*!< Bit mask of MULDIV field.      */

/* DBG @Bit 2 : value of DBG */
  #define VPRCSR_NORDIC_EXTPARAMS_DBG_Pos (2UL)      /*!< Position of DBG field.                                               */
  #define VPRCSR_NORDIC_EXTPARAMS_DBG_Msk (0x1UL << VPRCSR_NORDIC_EXTPARAMS_DBG_Pos) /*!< Bit mask of DBG field.               */

/* BKPT @Bits 3..6 : value of BKPT */
  #define VPRCSR_NORDIC_EXTPARAMS_BKPT_Pos (3UL)     /*!< Position of BKPT field.                                              */
  #define VPRCSR_NORDIC_EXTPARAMS_BKPT_Msk (0xFUL << VPRCSR_NORDIC_EXTPARAMS_BKPT_Pos) /*!< Bit mask of BKPT field.            */


/**
  * @brief AXCACHE [VPRCSR_NORDIC_AXCACHE] Memory type encoding
  */
  #define VPRCSR_NORDIC_AXCACHE (0x000007C5ul)
  #define VPRCSR_NORDIC_AXCACHE_ResetValue (0x00000EEEUL) /*!< Reset value of AXCACHE register.                                */

/* AWCACHE @Bits 0..3 : Memory type for data stores */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_Pos (0UL)    /*!< Position of AWCACHE field.                                           */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_Msk (0xFUL << VPRCSR_NORDIC_AXCACHE_AWCACHE_Pos) /*!< Bit mask of AWCACHE field.       */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_Min (0x0UL)  /*!< Min enumerator value of AWCACHE field.                               */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_Max (0xFUL)  /*!< Max enumerator value of AWCACHE field.                               */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_DEVNONBUFF (0x0UL) /*!< Device Non-Bufferable                                          */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_DEVBUFF (0x1UL) /*!< Device Bufferable                                                 */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_NNONCACHENONBUFF (0x2UL) /*!< Normal Non-cacheable Non-bufferable                      */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_NNONCACHEBUFF (0x3UL) /*!< Normal Non-cacheable Bufferable                             */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITETHNALLOC (0x6UL) /*!< Write-through No-allocate                                   */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITETHRALLOC (0x6UL) /*!< Write-through Read-allocate                                 */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITETHWALLOC (0xEUL) /*!< Write-through Write-allocate                                */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITETHRWALLOC (0xEUL) /*!< Write-through Read and Write-allocate                      */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITEBACKNALLOC (0x7UL) /*!< Write-back No-allocate                                    */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITEBACKRALLOC (0x7UL) /*!< Write-back Read-allocate                                  */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITEBACKWALLOC (0xFUL) /*!< Write-back Write-allocate                                 */
  #define VPRCSR_NORDIC_AXCACHE_AWCACHE_WRITEBACKRWALLOC (0xFUL) /*!< Write-back Read and Write-allocate                       */

/* IARCACHE @Bits 4..7 : Memory type for instruction loads */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_Pos (4UL)   /*!< Position of IARCACHE field.                                          */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_Msk (0xFUL << VPRCSR_NORDIC_AXCACHE_IARCACHE_Pos) /*!< Bit mask of IARCACHE field.    */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_Min (0x0UL) /*!< Min enumerator value of IARCACHE field.                              */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_Max (0xFUL) /*!< Max enumerator value of IARCACHE field.                              */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_DEVNONBUFF (0x0UL) /*!< Device Non-Bufferable                                         */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_DEVBUFF (0x1UL) /*!< Device Bufferable                                                */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_NNONCACHENONBUFF (0x2UL) /*!< Normal Non-cacheable Non-bufferable                     */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_NNONCACHEBUFF (0x3UL) /*!< Normal Non-cacheable Bufferable                            */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITETHNALLOC (0xAUL) /*!< Write-through No-allocate                                  */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITETHRALLOC (0xEUL) /*!< Write-through Read-allocate                                */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITETHWALLOC (0xAUL) /*!< Write-through Write-allocate                               */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITETHRWALLOC (0xEUL) /*!< Write-through Read and Write-allocate                     */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITEBACKNALLOC (0xBUL) /*!< Write-back No-allocate                                   */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITEBACKRALLOC (0xFUL) /*!< Write-back Read-allocate                                 */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITEBACKWALLOC (0xBUL) /*!< Write-back Write-allocate                                */
  #define VPRCSR_NORDIC_AXCACHE_IARCACHE_WRITEBACKRWALLOC (0xFUL) /*!< Write-back Read and Write-allocate                      */

/* DARCACHE @Bits 8..11 : Memory type for data loads */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_Pos (8UL)   /*!< Position of DARCACHE field.                                          */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_Msk (0xFUL << VPRCSR_NORDIC_AXCACHE_DARCACHE_Pos) /*!< Bit mask of DARCACHE field.    */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_Min (0x0UL) /*!< Min enumerator value of DARCACHE field.                              */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_Max (0xFUL) /*!< Max enumerator value of DARCACHE field.                              */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_DEVNONBUFF (0x0UL) /*!< Device Non-Bufferable                                         */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_DEVBUFF (0x1UL) /*!< Device Bufferable                                                */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_NNONCACHENONBUFF (0x2UL) /*!< Normal Non-cacheable Non-bufferable                     */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_NNONCACHEBUFF (0x3UL) /*!< Normal Non-cacheable Bufferable                            */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITETHNALLOC (0xAUL) /*!< Write-through No-allocate                                  */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITETHRALLOC (0xEUL) /*!< Write-through Read-allocate                                */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITETHWALLOC (0xAUL) /*!< Write-through Write-allocate                               */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITETHRWALLOC (0xEUL) /*!< Write-through Read and Write-allocate                     */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITEBACKNALLOC (0xBUL) /*!< Write-back No-allocate                                   */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITEBACKRALLOC (0xFUL) /*!< Write-back Read-allocate                                 */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITEBACKWALLOC (0xBUL) /*!< Write-back Write-allocate                                */
  #define VPRCSR_NORDIC_AXCACHE_DARCACHE_WRITEBACKRWALLOC (0xFUL) /*!< Write-back Read and Write-allocate                      */


/**
  * @brief CACHE [VPRCSR_NORDIC_CACHE] (unspecified)
  */

/**
  * @brief CTRL [VPRCSR_NORDIC_CACHE_CTRL] Cache control
  */
  #define VPRCSR_NORDIC_CACHE_CTRL (0x000007C8ul)
  #define VPRCSR_NORDIC_CACHE_CTRL_ResetValue (0x00000000UL) /*!< Reset value of CTRL register.                                */

/* ENABLE @Bit 0 : Enable cache */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Pos (0UL)  /*!< Position of ENABLE field.                                            */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Msk (0x1UL << VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Pos) /*!< Bit mask of ENABLE field.    */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Min (0x0UL) /*!< Min enumerator value of ENABLE field.                               */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Max (0x1UL) /*!< Max enumerator value of ENABLE field.                               */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Disabled (0x0UL) /*!< Cache disabled                                                 */
  #define VPRCSR_NORDIC_CACHE_CTRL_ENABLE_Enabled (0x1UL) /*!< Cache enabled                                                   */

/* CACHECLR @Bit 16 : Cache clear */
  #define VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Pos (16UL) /*!< Position of CACHECLR field.                                        */
  #define VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Msk (0x1UL << VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Pos) /*!< Bit mask of CACHECLR
                                                                            field.*/
  #define VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Min (0x0UL) /*!< Min enumerator value of CACHECLR field.                           */
  #define VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Max (0x1UL) /*!< Max enumerator value of CACHECLR field.                           */
  #define VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_NoOperation (0x0UL) /*!< No Operation                                              */
  #define VPRCSR_NORDIC_CACHE_CTRL_CACHECLR_Clear (0x1UL) /*!< Cache clear                                                     */


/**
  * @brief CFG [VPRCSR_NORDIC_CACHE_CFG] Cache configuration
  */
  #define VPRCSR_NORDIC_CACHE_CFG (0x000007C9ul)
  #define VPRCSR_NORDIC_CACHE_CFG_ResetValue (0x00000000UL) /*!< Reset value of CFG register.                                  */

