NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* INTEN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Pos (26UL)     /*!< Position of INTEN26 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN26_Pos) /*!< Bit mask of INTEN26 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Min (0x0UL)    /*!< Min enumerator value of INTEN26 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Max (0x1UL)    /*!< Max enumerator value of INTEN26 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[26]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN26_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[26]                                    */

/* INTEN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Pos (27UL)     /*!< Position of INTEN27 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN27_Pos) /*!< Bit mask of INTEN27 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Min (0x0UL)    /*!< Min enumerator value of INTEN27 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Max (0x1UL)    /*!< Max enumerator value of INTEN27 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[27]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN27_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[27]                                    */

/* INTEN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Pos (28UL)     /*!< Position of INTEN28 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN28_Pos) /*!< Bit mask of INTEN28 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Min (0x0UL)    /*!< Min enumerator value of INTEN28 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Max (0x1UL)    /*!< Max enumerator value of INTEN28 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[28]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN28_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[28]                                    */

/* INTEN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Pos (29UL)     /*!< Position of INTEN29 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN29_Pos) /*!< Bit mask of INTEN29 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Min (0x0UL)    /*!< Min enumerator value of INTEN29 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Max (0x1UL)    /*!< Max enumerator value of INTEN29 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[29]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN29_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[29]                                    */

/* INTEN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Pos (30UL)     /*!< Position of INTEN30 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN30_Pos) /*!< Bit mask of INTEN30 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Min (0x0UL)    /*!< Min enumerator value of INTEN30 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Max (0x1UL)    /*!< Max enumerator value of INTEN30 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[30]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN30_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[30]                                    */

/* INTEN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Pos (31UL)     /*!< Position of INTEN31 field.                                           */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Msk (0x1UL << VPRCSR_NORDIC_INTEN_INTEN31_Pos) /*!< Bit mask of INTEN31 field.           */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Min (0x0UL)    /*!< Min enumerator value of INTEN31 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Max (0x1UL)    /*!< Max enumerator value of INTEN31 field.                               */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Disabled (0x0UL) /*!< Interrupt disabled for EVENTS[31]                                  */
  #define VPRCSR_NORDIC_INTEN_INTEN31_Enabled (0x1UL) /*!< Interrupt enabled for EVENTS[31]                                    */


/**
  * @brief EVENTSB [VPRCSR_NORDIC_EVENTSB] Buffered DPPI Events
  */
  #define VPRCSR_NORDIC_EVENTSB (0x000007E5ul)
  #define VPRCSR_NORDIC_EVENTSB_ResetValue (0x00000000UL) /*!< Reset value of EVENTSB register.                                */

/* EVENTSB0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Pos (0UL)   /*!< Position of EVENTSB0 field.                                          */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB0_Pos) /*!< Bit mask of EVENTSB0 field.    */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Min (0x0UL) /*!< Min enumerator value of EVENTSB0 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Max (0x1UL) /*!< Max enumerator value of EVENTSB0 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Disabled (0x0UL) /*!< EVENTSB[0] disabled                                             */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB0_Enabled (0x1UL) /*!< EVENTSB[0] enabled                                               */

/* EVENTSB1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Pos (1UL)   /*!< Position of EVENTSB1 field.                                          */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB1_Pos) /*!< Bit mask of EVENTSB1 field.    */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Min (0x0UL) /*!< Min enumerator value of EVENTSB1 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Max (0x1UL) /*!< Max enumerator value of EVENTSB1 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Disabled (0x0UL) /*!< EVENTSB[1] disabled                                             */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB1_Enabled (0x1UL) /*!< EVENTSB[1] enabled                                               */

/* EVENTSB2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Pos (2UL)   /*!< Position of EVENTSB2 field.                                          */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB2_Pos) /*!< Bit mask of EVENTSB2 field.    */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Min (0x0UL) /*!< Min enumerator value of EVENTSB2 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Max (0x1UL) /*!< Max enumerator value of EVENTSB2 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Disabled (0x0UL) /*!< EVENTSB[2] disabled                                             */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB2_Enabled (0x1UL) /*!< EVENTSB[2] enabled                                               */

/* EVENTSB3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Pos (3UL)   /*!< Position of EVENTSB3 field.                                          */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Msk (0x1UL << VPRCSR_NORDIC_EVENTSB_EVENTSB3_Pos) /*!< Bit mask of EVENTSB3 field.    */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Min (0x0UL) /*!< Min enumerator value of EVENTSB3 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Max (0x1UL) /*!< Max enumerator value of EVENTSB3 field.                              */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Disabled (0x0UL) /*!< EVENTSB[3] disabled                                             */
  #define VPRCSR_NORDIC_EVENTSB_EVENTSB3_Enabled (0x1UL) /*!< EVENTSB[3] enabled                                               */

