NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* DIRB6 @Bit 22 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB6_Pos (22UL)     /*!< Position of DIRB6 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB6_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB6_Pos) /*!< Bit mask of DIRB6 field.             */

/* DIRB7 @Bit 23 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB7_Pos (23UL)     /*!< Position of DIRB7 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB7_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB7_Pos) /*!< Bit mask of DIRB7 field.             */

/* DIRB8 @Bit 24 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB8_Pos (24UL)     /*!< Position of DIRB8 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB8_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB8_Pos) /*!< Bit mask of DIRB8 field.             */

/* DIRB9 @Bit 25 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB9_Pos (25UL)     /*!< Position of DIRB9 field.                                             */
  #define VPRCSR_NORDIC_DIROUTB_DIRB9_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB9_Pos) /*!< Bit mask of DIRB9 field.             */

/* DIRB10 @Bit 26 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB10_Pos (26UL)    /*!< Position of DIRB10 field.                                            */
  #define VPRCSR_NORDIC_DIROUTB_DIRB10_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB10_Pos) /*!< Bit mask of DIRB10 field.          */

/* DIRB11 @Bit 27 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB11_Pos (27UL)    /*!< Position of DIRB11 field.                                            */
  #define VPRCSR_NORDIC_DIROUTB_DIRB11_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB11_Pos) /*!< Bit mask of DIRB11 field.          */

/* DIRB12 @Bit 28 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB12_Pos (28UL)    /*!< Position of DIRB12 field.                                            */
  #define VPRCSR_NORDIC_DIROUTB_DIRB12_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB12_Pos) /*!< Bit mask of DIRB12 field.          */

/* DIRB13 @Bit 29 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB13_Pos (29UL)    /*!< Position of DIRB13 field.                                            */
  #define VPRCSR_NORDIC_DIROUTB_DIRB13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB13_Pos) /*!< Bit mask of DIRB13 field.          */

/* DIRB14 @Bit 30 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB14_Pos (30UL)    /*!< Position of DIRB14 field.                                            */
  #define VPRCSR_NORDIC_DIROUTB_DIRB14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB14_Pos) /*!< Bit mask of DIRB14 field.          */

/* DIRB15 @Bit 31 : Buffered GPIO pin Direction */
  #define VPRCSR_NORDIC_DIROUTB_DIRB15_Pos (31UL)    /*!< Position of DIRB15 field.                                            */
  #define VPRCSR_NORDIC_DIROUTB_DIRB15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTB_DIRB15_Pos) /*!< Bit mask of DIRB15 field.          */


/**
  * @brief OUTBRB [VPRCSR_NORDIC_OUTBRB] Byte reversed register OUTB
  */
  #define VPRCSR_NORDIC_OUTBRB (0x00000BC8ul)
  #define VPRCSR_NORDIC_OUTBRB_ResetValue (0x00000000UL) /*!< Reset value of OUTBRB register.                                  */

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBRB_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_OUTBRB_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBRB_VAL_Pos) /*!< Bit mask of VAL field.              */
  #define VPRCSR_NORDIC_OUTBRB_VAL_Min (0x00000000UL) /*!< Min value of VAL field.                                             */
  #define VPRCSR_NORDIC_OUTBRB_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/**
  * @brief OUTBRW [VPRCSR_NORDIC_OUTBRW] Word reversed register OUTB
  */
  #define VPRCSR_NORDIC_OUTBRW (0x00000BC9ul)
  #define VPRCSR_NORDIC_OUTBRW_ResetValue (0x00000000UL) /*!< Reset value of OUTBRW register.                                  */

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTBRW_VAL_Pos (0UL)         /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_OUTBRW_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_OUTBRW_VAL_Pos) /*!< Bit mask of VAL field.              */
  #define VPRCSR_NORDIC_OUTBRW_VAL_Min (0x00000000UL) /*!< Min value of VAL field.                                             */
  #define VPRCSR_NORDIC_OUTBRW_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                              */


/**
  * @brief INBRB [VPRCSR_NORDIC_INBRB] Byte reversed register INB
  */
  #define VPRCSR_NORDIC_INBRB (0x00000BCAul)
  #define VPRCSR_NORDIC_INBRB_ResetValue (0x00000000UL) /*!< Reset value of INBRB register.                                    */

/* VAL @Bits 0..31 : (unspecified) */
  #define VPRCSR_NORDIC_INBRB_VAL_Pos (0UL)          /*!< Position of VAL field.                                               */
  #define VPRCSR_NORDIC_INBRB_VAL_Msk (0xFFFFFFFFUL << VPRCSR_NORDIC_INBRB_VAL_Pos) /*!< Bit mask of VAL field.                */
  #define VPRCSR_NORDIC_INBRB_VAL_Min (0x00000000UL) /*!< Min value of VAL field.                                              */
  #define VPRCSR_NORDIC_INBRB_VAL_Max (0xFFFFFFFFUL) /*!< Max size of VAL field.                                               */


/**
  * @brief SHIFTCTRLB [VPRCSR_NORDIC_SHIFTCTRLB] Buffered IO shift control
  */
  #define VPRCSR_NORDIC_SHIFTCTRLB (0x00000BCBul)
  #define VPRCSR_NORDIC_SHIFTCTRLB_ResetValue (0x00000000UL) /*!< Reset value of SHIFTCTRLB register.                          */

/* Field group SHIFTCNTB : (unspecified) */
/* VALUE @Bits 0..5 : Alias to SHIFTCNTB.VALUE register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Pos (0UL) /*!< Position of VALUE field.                                   */
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Msk (0x3FUL << VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Pos) /*!< Bit mask
                                                                            of VALUE field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Min (0x00UL) /*!< Min value of VALUE field.                               */
    #define VPRCSR_NORDIC_SHIFTCTRLB_SHIFTCNTB_VALUE_Max (0x3FUL) /*!< Max size of VALUE field.                                */

/* End field group SHIFTCNTB. */

/* Field group OUTMODEB : (unspecified) */
/* MODE @Bits 8..10 : Alias to OUTMODEB.MODE register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Pos (8UL) /*!< Position of MODE field.                                      */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Msk (0x7UL << VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Pos) /*!< Bit mask of
                                                                            MODE field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Min (0x0UL) /*!< Min enumerator value of MODE field.                        */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_Max (0x4UL) /*!< Max enumerator value of MODE field.                        */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_NoShifting (0x0UL) /*!< No shifting                                         */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_OutBBuf (0x2UL) /*!< Only OUTB used for buffering                           */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_MODE_OutBBufToggleClk (0x4UL) /*!< Only OUTB used for buffering, auto-toggle clock
                                                                            line*/

/* FRAMEWIDTH @Bits 12..16 : Alias to OUTMODEB.FRAMEWIDTH register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Pos (12UL) /*!< Position of FRAMEWIDTH field.                         */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Msk (0x1FUL << VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Pos) /*!<
                                                                            Bit mask of FRAMEWIDTH field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Min (0x00UL) /*!< Min value of FRAMEWIDTH field.                      */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_FRAMEWIDTH_Max (0x10UL) /*!< Max size of FRAMEWIDTH field.                       */

/* SEL @Bits 24..27 : Alias to OUTMODEB.SEL register */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_SEL_Pos (24UL) /*!< Position of SEL field.                                       */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_SEL_Msk (0xFUL << VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_SEL_Pos) /*!< Bit mask of SEL
                                                                            field.*/
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_SEL_Min (0x0UL) /*!< Min value of SEL field.                                     */
    #define VPRCSR_NORDIC_SHIFTCTRLB_OUTMODEB_SEL_Max (0xFUL) /*!< Max size of SEL field.                                      */

