NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54lv10a_types.h
/* DIR13 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Pos (29UL)   /*!< Position of DIR13 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR13_Pos) /*!< Bit mask of DIR13 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Min (0x0UL)  /*!< Min enumerator value of DIR13 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_Max (0x1UL)  /*!< Max enumerator value of DIR13 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR13_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* DIR14 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Pos (30UL)   /*!< Position of DIR14 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR14_Pos) /*!< Bit mask of DIR14 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Min (0x0UL)  /*!< Min enumerator value of DIR14 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_Max (0x1UL)  /*!< Max enumerator value of DIR14 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR14_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */

/* DIR15 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Pos (31UL)   /*!< Position of DIR15 field.                                             */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Msk (0x1UL << VPRCSR_NORDIC_DIROUTTGL_DIR15_Pos) /*!< Bit mask of DIR15 field.         */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Min (0x0UL)  /*!< Min enumerator value of DIR15 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_Max (0x1UL)  /*!< Max enumerator value of DIR15 field.                                 */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                           */
  #define VPRCSR_NORDIC_DIROUTTGL_DIR15_TOGGLE (0x1UL) /*!< Pin is toggled                                                     */


/**
  * @brief DIROUTBTGL [VPRCSR_NORDIC_DIROUTBTGL] DIROUTB Toggle
  */
  #define VPRCSR_NORDIC_DIROUTBTGL (0x00000BD5ul)
  #define VPRCSR_NORDIC_DIROUTBTGL_ResetValue (0x00000000UL) /*!< Reset value of DIROUTBTGL register.                          */

/* OUTB0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Pos (0UL)   /*!< Position of OUTB0 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Pos) /*!< Bit mask of OUTB0 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Min (0x0UL) /*!< Min enumerator value of OUTB0 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_Max (0x1UL) /*!< Max enumerator value of OUTB0 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB0_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

/* OUTB1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Pos (1UL)   /*!< Position of OUTB1 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Pos) /*!< Bit mask of OUTB1 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Min (0x0UL) /*!< Min enumerator value of OUTB1 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_Max (0x1UL) /*!< Max enumerator value of OUTB1 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB1_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

/* OUTB2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Pos (2UL)   /*!< Position of OUTB2 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Pos) /*!< Bit mask of OUTB2 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Min (0x0UL) /*!< Min enumerator value of OUTB2 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_Max (0x1UL) /*!< Max enumerator value of OUTB2 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB2_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

/* OUTB3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Pos (3UL)   /*!< Position of OUTB3 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Pos) /*!< Bit mask of OUTB3 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Min (0x0UL) /*!< Min enumerator value of OUTB3 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_Max (0x1UL) /*!< Max enumerator value of OUTB3 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB3_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

/* OUTB4 @Bit 4 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Pos (4UL)   /*!< Position of OUTB4 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Pos) /*!< Bit mask of OUTB4 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Min (0x0UL) /*!< Min enumerator value of OUTB4 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_Max (0x1UL) /*!< Max enumerator value of OUTB4 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB4_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

/* OUTB5 @Bit 5 : (unspecified) */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Pos (5UL)   /*!< Position of OUTB5 field.                                             */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Msk (0x1UL << VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Pos) /*!< Bit mask of OUTB5 field.       */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Min (0x0UL) /*!< Min enumerator value of OUTB5 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_Max (0x1UL) /*!< Max enumerator value of OUTB5 field.                                 */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_UNCHANGED (0x0UL) /*!< Pin remains unchanged                                          */
  #define VPRCSR_NORDIC_DIROUTBTGL_OUTB5_TOGGLE (0x1UL) /*!< Pin is toggled                                                    */

